[
  {
    "Id": "3755f1e8-2f8a-476a-9bdb-bd0ab3873904",
    "Name": "Stephen King",
    "ImagePath": "/images/authors/stephen-king.jpg",
    "Biography": "Stephen Edwin King (born September 21, 1947) is an American author of horror, supernatural fiction, suspense, crime, and fantasy novels. He is often referred to as the 'King of Horror,' but his work spans many genres, earning him a reputation as one of the most prolific and successful authors of our time. King's novels have sold more than 350 million copies, many of which have been adapted into feature films, miniseries, television series, and comic books. Notable works include Carrie, The Shining, IT, Misery, Pet Sematary, and The Dark Tower series. King is renowned for his ability to create compelling, complex characters and for his mastery of building suspenseful, intricately woven narratives. Aside from his novels, he has written nearly 200 short stories, most of which have been compiled into collections such as Night Shift, Skeleton Crew, and Everything's Eventual. He has received numerous awards for his contributions to literature, including the National Book Foundation's Medal for Distinguished Contribution to American Letters in 2003. King often writes under the pen name 'Richard Bachman,' a pseudonym he used to publish early works such as Rage and The Long Walk. He lives in Bangor, Maine, with his wife, fellow novelist Tabitha King, and continues to write and inspire new generations of readers and writers.",
    "PenName": "Richard Bachman",
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 182,
    "Gender": 0,
    "BornAt": "1947-09-21T00:00:00",
    "DiedAt": null,
    "IsApproved": true
  },
  {
    "Id": "b060c2a7-3b92-4b33-a547-59679c9c1d74",
    "Name": "Joanne Rowling",
    "ImagePath": "/images/authors/joanne-rowling.jpg",
    "Biography": "Joanne Rowling (born July 31, 1965), known by her pen name J.K. Rowling, is a British author and philanthropist. She is best known for writing the Harry Potter series, a seven-book fantasy saga that has become a global phenomenon. The series has sold over 600 million copies, been translated into 84 languages, and inspired a massive multimedia franchise, including blockbuster films, stage plays, video games, and theme parks. Notable works include Harry Potter and the Philosopher's Stone, Harry Potter and the Deathly Hallows, and The Tales of Beedle the Bard. Rowling's writing is praised for its imaginative world-building, compelling characters, and exploration of themes such as love, loyalty, and the battle between good and evil. After completing the Harry Potter series, Rowling transitioned to writing for adults, debuting with The Casual Vacancy, a contemporary social satire. She also writes crime fiction under the pseudonym Robert Galbraith, authoring the acclaimed Cormoran Strike series. Rowling has received numerous awards and honors for her literary achievements, including the Order of the British Empire (OBE) for services to children’s literature. She is an advocate for various charitable causes and founded the Volant Charitable Trust to combat social inequality. Rowling lives in Scotland with her family and continues to write, inspiring readers of all ages with her imaginative storytelling and philanthropy.",
    "PenName": "J. K. Rowling",
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 181,
    "Gender": 1,
    "BornAt": "1965-07-31T00:00:00",
    "DiedAt": null,
    "IsApproved": true
  },
  {
    "Id": "bb462072-1c71-44c0-9df3-6739b9ac847e",
    "Name": "John Ronald Reuel Tolkien",
    "ImagePath": "/images/authors/john-ronald-reuel-tolkien.jpg",
    "Biography": "John Ronald Reuel Tolkien (January 3, 1892 – September 2, 1973) was an English writer, philologist, and academic. He is best known as the author of The Hobbit and The Lord of the Rings, two of the most beloved works in modern fantasy literature. Tolkien's work has had a profound impact on the fantasy genre, establishing many of the conventions and archetypes that define it today. Set in the richly detailed world of Middle-earth, his stories feature intricate mythologies, languages, and histories, reflecting his scholarly expertise in philology and medieval studies. The Hobbit (1937) was a critical and commercial success, leading to the epic sequel The Lord of the Rings trilogy (1954–1955), which has sold over 150 million copies and been adapted into award-winning films by director Peter Jackson. Tolkien also authored The Silmarillion, a collection of myths and legends that expand the lore of Middle-earth. He served as a professor of Anglo-Saxon at the University of Oxford, where he was a member of the literary group The Inklings, alongside C.S. Lewis. Tolkien's contributions to literature earned him global acclaim and a lasting legacy as the 'father of modern fantasy.' He passed away in 1973, but his works continue to captivate readers worldwide.",
    "PenName": "J.R.R Tolkien",
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 181,
    "Gender": 0,
    "BornAt": "1892-01-03T00:00:00",
    "DiedAt": "1973-09-02T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "754c7d94-d850-4a85-bcfb-d4757e3c4c9d",
    "Name": "Ken Kesey",
    "ImagePath": "/images/authors/ken-kesey.jpg",
    "Biography": "Ken Elton Kesey (September 17, 1935 – November 10, 2001) was an American novelist, essayist, and countercultural figure. He is best known for his debut novel One Flew Over the Cuckoo's Nest (1962), which explores themes of individuality, authority, and mental health. The novel became an instant classic, earning critical acclaim for its portrayal of life inside a psychiatric institution and inspiring a celebrated 1975 film adaptation starring Jack Nicholson that won five Academy Awards. Kesey was deeply involved in the counterculture movement of the 1960s, becoming a key figure among the Merry Pranksters, a group famous for their cross-country bus trip chronicled in Tom Wolfe's The Electric Kool-Aid Acid Test. His second novel, Sometimes a Great Notion (1964), was praised for its ambitious narrative structure and portrayal of family dynamics. Kesey's work often reflects his fascination with the human condition, rebellion, and the nature of freedom. In addition to his literary career, Kesey experimented with psychedelics, drawing inspiration from his participation in government experiments and his own personal experiences. He remained an influential voice in American literature and culture, inspiring generations of readers and writers to question societal norms and explore new perspectives. Kesey passed away in 2001, leaving behind a legacy of bold storytelling and a spirit of rebellion.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 182,
    "Gender": 0,
    "BornAt": "1935-09-17T00:00:00",
    "DiedAt": "2001-11-10T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "65f7f75a-3510-4272-9347-fa58699e7ec9",
    "Name": "George Orwell",
    "ImagePath": "/images/authors/george-orwell.jpg",
    "Biography": "Eric Arthur Blair (June 25, 1903 – January 21, 1950), known by his pen name George Orwell, was an English novelist, essayist, journalist, and critic. Orwell is best known for his works Animal Farm (1945) and Nineteen Eighty-Four (1949), both of which are considered cornerstones of modern English literature and have had a lasting impact on political thought. Animal Farm, an allegorical novella satirizing the Russian Revolution and the rise of Stalinism, has become a standard in literature about totalitarianism and political corruption. Nineteen Eighty-Four, a dystopian novel set in a totalitarian society controlled by Big Brother, has influenced political discourse around surveillance, propaganda, and government control. Orwell's writings often sexplore themes of social injustice, totalitarianism, and the misuse of power. He was an ardent critic of fascism and communism and was deeply involved in political activism, including fighting in the Spanish Civil War, which influenced his strong anti-authoritarian views. Orwell's style is known for its clarity, precision, and biting social commentary, and his work continues to be relevant and influential in discussions on politics, language, and individual rights. Orwell passed away in 1950 at the age of 46, but his work remains widely read and influential, especially in the context of discussions surrounding state power, civil liberties, and the role of the individual in society.",
    "PenName": "George Orwell",
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 181,
    "Gender": 0,
    "BornAt": "1903-06-25T00:00:00",
    "DiedAt": "1950-01-21T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "18db3995-414e-4786-8205-cbfd849ac65f",
    "Name": "Bram Stoker",
    "ImagePath": "/images/authors/bram-stoker.jpg",
    "Biography": "Abraham 'Bram' Stoker (November 8, 1847 – April 20, 1912) was an Irish author best known for his Gothic horror novel Dracula, which has become a classic of literature and a foundational work in the vampire genre. Born in Dublin, Ireland, Stoker was a writer, theater manager, and journalist. While Dracula is his most famous work, Stoker wrote numerous other novels, short stories, and essays. He was greatly influenced by Gothic fiction and folklore, particularly Eastern European myths about vampires, which he drew upon to create his iconic antagonist, Count Dracula. Stoker's Dracula introduced the figure of the vampire into mainstream literature and has inspired countless adaptations in film, theater, and popular culture. Though Stoker's works initially received mixed critical reception, Dracula gained increasing recognition and has had a lasting impact on the horror genre. Stoker's writing was often characterized by vivid, atmospheric descriptions and psychological complexity, and his portrayal of fear, desire, and the supernatural remains influential today. Stoker passed away in 1912 at the age of 64, but his legacy as the creator of one of literature's most enduring villains continues to captivate readers around the world.",
    "PenName": "Bram Stoker",
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 78,
    "Gender": 0,
    "BornAt": "1847-11-08T00:00:00",
    "DiedAt": "1912-04-20T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "c6e75962-e121-4da4-9116-44fbbbd29291",
    "Name": "Anthony Burgess",
    "ImagePath": "/images/authors/anthony-burgess.jpg",
    "Biography": "John Anthony Burgess Wilson (February 25, 1917 – November 25, 1993) was an English author, composer, and linguist, best known for his dystopian novel A Clockwork Orange. Born in Manchester, England, Burgess worked in a variety of fields before becoming a full-time writer. His work often explores themes of free will, violence, and social control. A Clockwork Orange, published in 1962, became a landmark work in the genre of dystopian fiction, and the controversial novel was later adapted into a famous film by Stanley Kubrick. Burgess was also known for his deep knowledge of language and for his ability to create complex, linguistically rich narratives. Throughout his career, Burgess wrote numerous novels, short stories, plays, and essays, in addition to works of music and translations. His works, while not always critically lauded, gained a loyal following, and he is considered an influential figure in British literature. Burgess continued to write prolifically until his death in 1993 at the age of 76.",
    "PenName": "Anthony Burgess",
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "NationalityId": 181,
    "Gender": 0,
    "BornAt": "1917-02-25T00:00:00",
    "DiedAt": "1993-11-25T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "3c44f945-8398-4c44-b962-9e2ea929fda4",
    "Name": "Agatha Christie",
    "ImagePath": "/images/authors/agatha-christie.jpg",
    "Biography": "Agatha Mary Clarissa Christie (September 15, 1890 – January 12, 1976) was an English writer, widely recognized for her detective fiction. She is best known for creating iconic characters such as Hercule Poirot and Miss Marple, who became central figures in numerous detective novels, short stories, and plays. Christie’s writing is characterized by intricate plots, psychological depth, and unexpected twists. Her first novel, The Mysterious Affair at Styles, introduced the world to Hercule Poirot in 1920. Over the following decades, Christie would become the best-selling novelist of all time, with over two billion copies of her books sold worldwide. Her works have been translated into over 100 languages, and her influence on the mystery genre is profound. Christie was appointed a Dame Commander of the Order of the British Empire in 1971. She continued writing until her death in 1976, leaving behind a legacy that includes Murder on the Orient Express, Death on the Nile, and And Then There Were None.",
    "PenName": "Agatha Christie",
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 181,
    "Gender": 1,
    "BornAt": "1890-09-15T00:00:00",
    "DiedAt": "1976-01-12T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "f0167a81-2161-47fa-84ac-a8332179a226",
    "Name": "John Steinbeck",
    "ImagePath": "/images/authors/john-steinbeck.jpg",
    "Biography": "John Ernst Steinbeck Jr. (February 27, 1902 – December 20, 1968) was an American author known for his impactful portrayal of the struggles of the working class and the disenfranchised. His novels, such as 'The Grapes of Wrath', 'Of Mice and Men', and 'East of Eden', often explored themes of poverty, social injustice, and the human condition. Steinbeck won the Nobel Prize for Literature in 1962 for his realistic and imaginative writings, which had a lasting effect on American literature. Born in Salinas, California, Steinbeck's early works depicted life during the Great Depression, while his later novels explored more personal and philosophical themes. He is best remembered for his compassion for ordinary people and his insightful critiques of social systems. His writing style was marked by his use of vivid, poetic descriptions and a deep understanding of his characters' struggles.",
    "PenName": "John Steinbeck",
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 182,
    "Gender": 0,
    "BornAt": "1902-02-27T00:00:00",
    "DiedAt": "1968-12-20T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "3b2ffee2-4200-42c7-9eb3-d30933899eb3",
    "Name": "Frank Herbert",
    "ImagePath": "/images/authors/frank-herbert.jpg",
    "Biography": "Frank Herbert (October 8, 1920 – February 11, 1986) was an American science fiction author best known for his landmark series Dune. Herbert's work frequently explored themes of politics, religion, and ecology. *Dune*, first published in 1965, remains one of the most influential and best-selling science fiction novels of all time, winning the Hugo and Nebula Awards. Born in Tacoma, Washington, Herbert began his writing career as a journalist, before transitioning to fiction writing. His Dune series, which consists of six novels, delves into the complexities of power, governance, environmentalism, and the human condition. Herbert's distinctive writing style is known for its philosophical depth, intricate world-building, and the exploration of human evolution. His work has had a profound influence on both science fiction and popular culture. Herbert passed away in 1986, but his legacy continues through his novels, which are still widely read and respected today.",
    "PenName": "Frank Herbert",
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 182,
    "Gender": 0,
    "BornAt": "1920-10-08T00:00:00",
    "DiedAt": "1986-02-11T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "1ef14d3c-6285-4d97-b238-f7e6bbd3a749",
    "Name": "Douglas Adams",
    "ImagePath": "/images/authors/douglas-adams.jpg",
    "Biography": "Douglas Adams (March 11, 1952 – May 11, 2001) was an English author, best known for his science fiction series The Hitchhiker's Guide to the Galaxy. Adams’ works are renowned for their wit, absurdity, and philosophical depth. Born in Cambridge, England, Adams began his career in comedy writing before transitioning into fiction. The Hitchhiker's Guide to the Galaxy, first published as a radio play in 1978 and later as a novel in 1979, became a cultural phenomenon, blending humor, satire, and sci-fi elements into a beloved classic. The series, which spans multiple books, explores themes of existence, the absurdity of life, and the universe in a way that resonates with both fans of science fiction and general readers. Adams’ distinctive voice and irreverent humor continue to inspire and entertain readers today. He also worked as a scriptwriter and wrote other notable works, including Dirk Gently's Holistic Detective Agency. Adams passed away in 2001 at the age of 49, but his influence on the science fiction genre and popular culture remains enduring.",
    "PenName": "Douglas Adams",
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 181,
    "Gender": 0,
    "BornAt": "1952-03-11T00:00:00",
    "DiedAt": "2001-05-11T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "4f2bc2d3-0d7a-4a3a-9f7b-3a9e2f1c6b11",
    "Name": "William Shakespeare",
    "ImagePath": "/images/authors/william-shakespeare.jpg",
    "Biography": "William Shakespeare (baptised April 26, 1564 – April 23, 1616) was an English playwright, poet, and actor, widely regarded as one of the greatest writers in the English language and the world’s pre-eminent dramatist. Born in Stratford-upon-Avon, Warwickshire, he became a central figure in London’s theatrical scene as a member and shareholder of the Lord Chamberlain’s Men, later known as the King’s Men. Shakespeare’s surviving works include 39 plays, 154 sonnets, and several narrative poems, spanning genres such as tragedy, comedy, history, and romance. His most celebrated plays—among them Hamlet, Macbeth, Othello, King Lear, Romeo and Juliet, A Midsummer Night’s Dream, and The Tempest—are renowned for their complex characters, poetic language, and profound exploration of themes like love, power, ambition, jealousy, time, and mortality. His sonnets, first published in 1609, helped shape the development of English lyric poetry. Shakespeare’s work transformed the stage of the Elizabethan and Jacobean eras and has since been translated into every major living language and performed more often than that of any other playwright. Despite the relative scarcity of personal records about his life, his literary legacy continues to influence writers, scholars, and audiences around the world, securing his place as a foundational figure in Western literature and drama.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 181,
    "Gender": 0,
    "BornAt": "1564-04-23T00:00:00",
    "DiedAt": "1616-04-23T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "9c3f7a52-5c4c-4e9b-8b67-1f2a4c7e3b90",
    "Name": "Samuel Langhorne Clemens",
    "ImagePath": "/images/authors/samuel-langhorne-clemens.jpg",
    "Biography": "Samuel Langhorne Clemens (November 30, 1835 – April 21, 1910), better known by his pen name Mark Twain, was an American writer, humorist, lecturer, and journalist. Born in Florida, Missouri, and raised in the river town of Hannibal, he drew heavily on his childhood experiences along the Mississippi River to create some of the most iconic works in American literature. Twain’s best-known novels include The Adventures of Tom Sawyer (1876) and Adventures of Huckleberry Finn (1884), the latter often hailed as one of the greatest American novels for its vivid depiction of antebellum life and its piercing exploration of race, freedom, and moral conscience. Before achieving literary fame, Clemens worked as a printer’s apprentice, typesetter, steamboat pilot, miner, and newspaper reporter, experiences that greatly informed his sharp observational humor and plainspoken style. His writing is renowned for its wit, satire, and keen social commentary, often critiquing hypocrisy, corruption, and prejudice. Twain was also a popular public speaker, traveling widely in the United States and abroad to deliver lectures that blended storytelling and comedy. Despite periods of financial difficulty, including failed business ventures and bankruptcy, he remained a towering figure in letters until his death in 1910. His works continue to be studied and read worldwide, securing his legacy as one of the central figures in American and world literature.",
    "PenName": "Mark Twain",
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 182,
    "Gender": 0,
    "BornAt": "1835-11-30T00:00:00",
    "DiedAt": "1910-04-21T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "2c603a75-2242-4f2e-8db0-8f3e2a323bbb",
    "Name": "Jane Austen",
    "ImagePath": "/images/authors/jane-austen.jpg",
    "Biography": "Jane Austen (16 December 1775 – 18 July 1817) was an English novelist whose works of romantic fiction, social commentary, and keen psychological insight have made her one of the most widely read and beloved authors in the English language. Born in Steventon, Hampshire, into a close-knit clerical family, Austen began writing stories and sketches in her youth, developing her craft through what are now known as her Juvenilia. Her novels are celebrated for their wit, irony, and finely observed depictions of early 19th-century English society, particularly the lives, manners, and marriage prospects of the landed gentry.\n\nAusten’s major novels include Sense and Sensibility, Pride and Prejudice, Mansfield Park, and Emma, all published anonymously during her lifetime, as well as the posthumously published Northanger Abbey and Persuasion. Through characters such as Elizabeth Bennet and Emma Woodhouse, she explored themes of love, morality, class, economic security, and the constraints placed on women in a patriarchal society. Her precise, elegant prose and use of free indirect discourse were innovative for their time and have influenced generations of writers. Although she enjoyed only modest fame while alive, Austen’s reputation grew steadily in the 19th and 20th centuries, and today her works are frequently adapted into films, television series, and stage productions. She died in Winchester at the age of 41, leaving behind an enduring literary legacy that continues to captivate readers around the world.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 181,
    "Gender": 1,
    "BornAt": "1775-12-16T00:00:00",
    "DiedAt": "1817-07-18T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "6f5a0b53-5c0e-4e7a-9d54-8bcb9bbf8899",
    "Name": "Ernest Miller Hemingway",
    "ImagePath": "/images/authors/ernest-hemingway.jpg",
    "Biography": "Ernest Miller Hemingway (July 21, 1899 – July 2, 1961) was an American novelist, short story writer, and journalist whose distinctively economical prose style and focus on themes of courage, loss, and endurance made him one of the most influential writers of the 20th century. Born in Oak Park, Illinois, Hemingway began his career as a reporter before volunteering as an ambulance driver on the Italian front during World War I, an experience that profoundly shaped his worldview and later fiction. In the 1920s he lived in Paris among a circle of expatriate writers and artists often referred to as the \"Lost Generation,\" refining his craft and developing his trademark \"iceberg theory\" of writing, in which the deeper meaning of a story is implied rather than explicitly stated.\n\nHemingway’s major works include The Sun Also Rises, A Farewell to Arms, For Whom the Bell Tolls, and The Old Man and the Sea, as well as influential short story collections such as In Our Time and Men Without Women. His fiction often centers on stoic protagonists facing physical and emotional trials against backdrops of war, wilderness, and sport, including bullfighting, big-game hunting, and deep-sea fishing. He worked as a correspondent during the Spanish Civil War and World War II, experiences that informed his later writing. In 1953 he received the Pulitzer Prize for The Old Man and the Sea, and in 1954 he was awarded the Nobel Prize in Literature for his mastery of narrative art. Hemingway spent much of his later life in Cuba and the United States, continuing to write despite declining health. He died in Ketchum, Idaho, but his spare, powerful prose and vivid portrayals of human resilience continue to resonate with readers around the world.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 182,
    "Gender": 0,
    "BornAt": "1899-07-21T00:00:00",
    "DiedAt": "1961-07-02T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "b8c4f846-1a1c-4e44-9c35-0a4a8e9f7c11",
    "Name": "Charles John Huffam Dickens",
    "ImagePath": "/images/authors/charles-dickens.jpg",
    "Biography": "Charles John Huffam Dickens (February 7, 1812 – June 9, 1870) was an English novelist, journalist, and social critic, widely regarded as one of the greatest writers of the Victorian era. Born in Portsmouth and raised in a family that struggled financially, Dickens experienced poverty firsthand, including a period in his youth when he worked in a blacking factory while his father was imprisoned for debt. These early experiences profoundly shaped his imagination and fueled the themes of social injustice, class inequality, and childhood hardship that run throughout his work. Dickens first achieved fame with The Pickwick Papers (1836–1837), and went on to publish a string of landmark novels, many released in serial form, including Oliver Twist, Nicholas Nickleby, A Christmas Carol, David Copperfield, Bleak House, Hard Times, Little Dorrit, A Tale of Two Cities, and Great Expectations. His stories combine memorable, often larger-than-life characters with vivid depictions of 19th-century London, balancing humor and sentiment with sharp social commentary. Beyond his fiction, Dickens was a tireless public figure: he edited weekly periodicals, wrote essays and short stories, and became famous for his dramatic public reading tours in Britain and the United States. His influence on literature and popular culture is immense, and his works have been continuously in print, adapted into countless stage, film, and television productions. Dickens died in 1870 and was buried in Poets’ Corner in Westminster Abbey, leaving a legacy as one of the most beloved and influential novelists in the English language.",
    "PenName": "Boz",
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 0,
    "Gender": 181,
    "BornAt": "1812-02-07T00:00:00",
    "DiedAt": "1870-06-09T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "f3148a2b-8f82-4fe0-9a0b-9b4ce3d8b1f2",
    "Name": "Francis Scott Key Fitzgerald",
    "ImagePath": "/images/authors/francis-scott-key-fitzgerald.jpg",
    "Biography": "Francis Scott Key Fitzgerald (September 24, 1896 – December 21, 1940) was an American novelist, short story writer, and essayist, widely regarded as one of the greatest chroniclers of the Jazz Age. Born in St. Paul, Minnesota, Fitzgerald attended Princeton University but left before graduating to join the U.S. Army during World War I. He achieved early literary fame with his debut novel, This Side of Paradise (1920), which captured the restless spirit of postwar youth and instantly made him a celebrity. Fitzgerald, together with his wife Zelda Sayre, became emblematic of the glamour and excess of the 1920s, living a whirlwind life in New York, Paris, and the French Riviera. His most celebrated novel, The Great Gatsby (1925), is a penetrating portrait of ambition, idealism, and disillusionment in an era of prosperity and moral ambiguity, and is now considered a cornerstone of American literature. Other major works include The Beautiful and Damned, Tender Is the Night, and numerous short stories published in magazines such as The Saturday Evening Post and Esquire, which often helped support his more ambitious fiction. Despite his early success, Fitzgerald struggled with financial instability, critical setbacks, and Zelda’s mental illness, and he battled alcoholism throughout his adult life. In his later years he moved to Hollywood, working as a screenwriter while attempting a literary comeback. He died of a heart attack in 1940 at the age of 44, largely believing himself a failure, but his posthumous reputation soared, and he is now recognized as one of the defining voices of 20th-century American literature.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 182,
    "Gender": 0,
    "BornAt": "1896-09-24T00:00:00",
    "DiedAt": "1940-12-21T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "a9f4c9b1-7d23-4a51-9a2b-0d3f2b8c6e11",
    "Name": "Gabriel José de la Concordia García Márquez",
    "ImagePath": "/images/authors/gabriel-garcia-marquez.jpg",
    "Biography": "Gabriel José de la Concordia García Márquez (March 6, 1927 – April 17, 2014) was a Colombian novelist, journalist, screenwriter, and one of the most influential writers of the 20th century. Often associated with the literary style of magical realism, he blended the fantastical and the mundane to explore themes of memory, solitude, love, power, and the cyclical nature of history, especially within the context of Latin American society and politics. His landmark novel One Hundred Years of Solitude, published in 1967, became a defining work of world literature, earning him international acclaim and helping to ignite the Latin American literary boom. Other notable works include Love in the Time of Cholera, Chronicle of a Death Foretold, The Autumn of the Patriarch, and The General in His Labyrinth. In addition to his fiction, García Márquez had a distinguished career as a journalist, maintaining a lifelong commitment to political and social issues in Latin America. He was awarded the Nobel Prize in Literature in 1982 for his novels and short stories, which, in the words of the Swedish Academy, combine the fantastic and the realistic in a richly composed world of imagination. Affectionately known as 'Gabo,' he remained a cultural icon in Colombia and across the Spanish-speaking world, and his works continue to shape contemporary literature and inspire readers worldwide.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 37,
    "Gender": 0,
    "BornAt": "1927-03-06T00:00:00",
    "DiedAt": "2014-04-17T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "e3b0c442-98fc-4f4d-b2a6-1f3b3c9bd9a1",
    "Name": "Lev Nikolayevich Tolstoy",
    "ImagePath": "/images/authors/leo-tolstoy.jpg",
    "Biography": "Lev Nikolayevich Tolstoy (September 9, 1828 – November 20, 1910), commonly known in the West as Leo Tolstoy, was a Russian novelist, moral philosopher, and social reformer, widely regarded as one of the greatest authors in world literature. Born into an aristocratic family at the estate of Yasnaya Polyana, he initially led a life marked by privilege, military service, and personal turmoil before undergoing a profound spiritual and moral transformation in midlife. Tolstoy’s best-known works, the epic novels War and Peace and Anna Karenina, are celebrated for their psychological depth, philosophical insight, and their sweeping portrayals of Russian society, history, and human relationships. Beyond fiction, Tolstoy wrote numerous essays and treatises on religion, nonviolence, education, and ethics, advocating for a simple, ascetic lifestyle and a return to what he saw as the core moral teachings of Christianity. His ideas on nonviolent resistance and moral responsibility deeply influenced figures such as Mahatma Gandhi and Martin Luther King Jr. In his later years, Tolstoy became increasingly critical of state institutions, organized religion, and social inequality, often clashing with both church and government authorities. He spent much of his life at Yasnaya Polyana, where he wrote, taught peasant children, and engaged in practical efforts at social reform. Tolstoy’s legacy endures not only through his monumental novels but also through his radical ethical and political thought, which continues to inspire readers, writers, and activists around the world.",
    "PenName": "Leo Tolstoy",
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 140,
    "Gender": 0,
    "BornAt": "1828-09-09T00:00:00",
    "DiedAt": "1910-11-20T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "e2b77c51-01b6-4c9d-9fd6-7ddad7ea6b30",
    "Name": "Fyodor Mikhailovich Dostoevsky",
    "ImagePath": "/images/authors/fyodor-mikhailovich-dostoevsky.jpg",
    "Biography": "Fyodor Mikhailovich Dostoevsky (November 11, 1821 – February 9, 1881) was a Russian novelist, short story writer, essayist, and journalist, widely regarded as one of the greatest and most influential writers in world literature. His works explore profound psychological, philosophical, and spiritual questions, often focusing on themes such as free will, morality, guilt, faith, suffering, and redemption. Born in Moscow and trained as a military engineer, Dostoevsky turned to literature in his twenties and quickly gained attention with his debut novel, Poor Folk (1846). His life took a dramatic turn when he was arrested in 1849 for involvement with a radical intellectual circle, sentenced to death, and subjected to a staged mock execution before having his punishment commuted to hard labor and exile in Siberia. This experience, along with his deepening religious faith and lifelong struggle with epilepsy and financial hardship, profoundly shaped his later writing.\n\nDostoevsky’s major works include Notes from Underground, Crime and Punishment, The Idiot, Demons (also known as The Devils or The Possessed), and The Brothers Karamazov. These novels are renowned for their complex characters, intense psychological depth, and exploration of moral dilemmas in the face of social upheaval and existential crisis. His innovative narrative techniques and philosophical insight helped lay the foundations for modern psychological fiction and existentialist thought, influencing writers, philosophers, and theologians across the globe. Despite personal tragedies, chronic illness, and constant debt fueled in part by a gambling addiction, Dostoevsky continued to write until his death in 1881. His work remains central to the study of literature and philosophy, and his searching examination of the human soul continues to resonate with readers worldwide.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 140,
    "Gender": 0,
    "BornAt": "1821-11-11T00:00:00",
    "DiedAt": "1881-02-09T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "9b0b1f0c-7d6d-4c3e-9e3c-2f4a5b6c7d8e",
    "Name": "Franz Kafka",
    "ImagePath": "/images/authors/franz-kafka.jpg",
    "Biography": "Franz Kafka (July 3, 1883 – June 3, 1924) was a German-language novelist and short story writer from Prague, widely regarded as one of the most important and influential writers of the 20th century. Born into a middle-class Jewish family in what was then part of the Austro-Hungarian Empire, Kafka lived much of his life torn between his demanding day job at an insurance company and his deep but often troubled commitment to writing. His works frequently explore themes of alienation, anxiety, guilt, and the absurdity of modern bureaucracy, creating nightmarish, labyrinthine worlds that mirror the inner turmoil of his protagonists.\n\nKafka’s most notable works include the novella The Metamorphosis, in which a man awakens to find himself transformed into an insect-like creature, and the unfinished novels The Trial and The Castle, both of which depict individuals caught in opaque, overpowering systems they cannot understand or overcome. His distinctive style and imaginative power gave rise to the term “Kafkaesque,” now commonly used to describe situations characterized by surreal, oppressive complexity and a sense of powerlessness. During his lifetime, Kafka published only a small portion of his work and instructed his friend and literary executor, Max Brod, to destroy his manuscripts after his death—a request Brod famously ignored, ensuring Kafka’s posthumous fame. Plagued by ill health, including tuberculosis, Kafka died at the age of 40 in 1924. Despite his relatively small body of work, his influence on modern literature, philosophy, and critical theory has been immense, and his writings continue to resonate with readers confronting the anxieties of contemporary life.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 43,
    "Gender": 0,
    "BornAt": "1883-07-03T00:00:00",
    "DiedAt": "1924-06-03T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "c8b8428f-1a4e-4e65-8c88-4d9f6f773d90",
    "Name": "Victor Hugo",
    "ImagePath": "/images/authors/victor-hugo.jpg",
    "Biography": "Victor Hugo (February 26, 1802 – May 22, 1885) was a French poet, novelist, and dramatist, widely regarded as one of the most important and influential writers of the 19th century. Born in Besançon, France, he rose to prominence as a leading figure of the Romantic movement, championing emotion, imagination, and individualism in reaction to classical restraint. Hugo’s literary output was vast and diverse, encompassing lyric poetry, plays, political pamphlets, and major novels. His best-known works include The Hunchback of Notre-Dame (1831), a Gothic tale set in medieval Paris that helped spur interest in preserving historic architecture, and Les Misérables (1862), an epic novel that weaves together themes of justice, redemption, love, and social inequality against the backdrop of 19th-century France. A committed political and social activist, Hugo used his writing and public voice to oppose tyranny, defend human rights, and criticize capital punishment. His opposition to Napoleon III led to years of exile on the Channel Islands, during which he continued to produce some of his most enduring works. After the fall of the Second Empire, Hugo returned to France as a national hero and remained a moral and cultural authority until his death. His funeral in 1885 drew millions of mourners, and he was interred in the Panthéon in Paris. Hugo’s legacy lives on through countless adaptations of his works for stage and screen, and he remains a towering figure in world literature.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 58,
    "Gender": 0,
    "BornAt": "1802-02-26T00:00:00",
    "DiedAt": "1885-05-22T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "9dc1c3f5-9b7c-4a9d-8f65-4c3a4f4f9b21",
    "Name": "Homer",
    "ImagePath": "/images/authors/homer.jpg",
    "Biography": "Homer is the legendary ancient Greek poet traditionally credited as the author of the epic poems the Iliad and the Odyssey, foundational works of Western literature. Thought to have lived sometime between the 8th and 7th centuries BCE, Homer is believed to have composed his epics within a rich oral tradition, using dactylic hexameter and formulaic expressions that allowed stories to be memorized and performed by bards. Little is known with certainty about his life, and even his existence as a single historical individual has been debated for centuries, a scholarly controversy known as the \"Homeric Question.\" According to later ancient sources, he may have come from Ionia, a region on the western coast of Asia Minor, and was often depicted as a blind poet, though these details remain part of legend rather than documented fact.\n\nThe Iliad focuses on a brief period near the end of the Trojan War, exploring themes of heroism, wrath, honor, mortality, and fate through characters such as Achilles, Hector, and Agamemnon. The Odyssey follows the long, perilous journey of Odysseus as he attempts to return home to Ithaca after the fall of Troy, blending adventure, folklore, and profound reflections on perseverance, identity, and homecoming. For ancient Greeks, Homer’s epics were far more than entertainment: they served as educational texts, moral guides, and cultural touchstones, shaping their understanding of gods, heroes, and human nature. Across millennia, Homer’s influence has extended through classical antiquity, the Renaissance, and into the modern era, inspiring countless adaptations, reinterpretations, and works of art. Despite the mysteries surrounding his life, Homer’s poetry remains a cornerstone of the literary canon and continues to be read, studied, and reimagined around the world.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 64,
    "Gender": 0,
    "BornAt": null,
    "DiedAt": null,
    "IsApproved": true
  },
  {
    "Id": "6e8e9a2b-3f4c-4b56-91a0-2f3b7c9d12e7",
    "Name": "Dante Alighieri",
    "ImagePath": "/images/authors/dante-alighieri.jpg",
    "Biography": "Dante Alighieri (c. 1265 – September 14, 1321) was an Italian poet, writer, and philosopher, widely regarded as one of the founding figures of Italian literature and one of the greatest poets in world history. Born in Florence, Dante lived during a time of intense political conflict between rival factions, experiences that deeply influenced both his life and his work. He was involved in Florentine politics and aligned with the White Guelphs, a stance that ultimately led to his exile when the opposing Black Guelphs seized control of the city. Forced to live the rest of his life away from Florence, he moved through various courts in Italy, including Verona and Ravenna. Dante’s masterpiece, the Divine Comedy, composed in vernacular Tuscan rather than Latin, is an epic three-part poem—Inferno, Purgatorio, and Paradiso—that follows the poet’s imagined journey through Hell, Purgatory, and Heaven. The work combines theology, philosophy, politics, and personal reflection, creating a vast allegorical vision of the soul’s journey toward God. It helped establish Tuscan as the basis for the modern Italian language and set a high standard for European literature. In addition to the Divine Comedy, Dante wrote important works such as La Vita Nuova, a blend of prose and poetry centered on his idealized love for Beatrice, and De Monarchia, a Latin treatise on political theory. He died in Ravenna in 1321, still in exile from his beloved Florence. Dante’s influence on literature, language, and thought has been enduring, and he is often honored as the 'father of the Italian language.'",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 80,
    "Gender": 0,
    "BornAt": null,
    "DiedAt": "1321-09-14T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "c28f5f6b-4c1b-4c2f-9b52-9a4a6d2f9173",
    "Name": "Edgar Allan Poe",
    "ImagePath": "/images/authors/edgar-allan-poe.jpg",
    "Biography": "Edgar Allan Poe (January 19, 1809 – October 7, 1849) was an American writer, poet, editor, and literary critic, best known for his macabre and psychologically intense tales that helped shape the modern genres of horror, mystery, and detective fiction. Born in Boston and orphaned at a young age, Poe was taken in by the Allan family in Richmond, Virginia, though his relationship with his foster father was strained and often tumultuous. His life was marked by financial hardship, personal loss, and bouts of ill health, experiences that informed the dark, melancholic tone of much of his work. Poe gained fame for short stories such as \"The Tell-Tale Heart,\" \"The Fall of the House of Usher,\" \"The Masque of the Red Death,\" and \"The Cask of Amontillado,\" as well as the narrative poem \"The Raven,\" which made him a literary celebrity during his lifetime. He is also credited with pioneering the detective story through works like \"The Murders in the Rue Morgue\" and \"The Purloined Letter,\" influencing later writers including Arthur Conan Doyle and Agatha Christie. In addition to his fiction, Poe worked as an editor and critic, known for his sharp, often scathing reviews and for articulating theories of composition and aesthetics that emphasized unity of effect and emotional impact. Though he died under mysterious and tragic circumstances at the age of forty, Poe’s legacy has only grown over time, and he remains a central figure in American literature and a foundational influence on Gothic and speculative fiction worldwide.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 182,
    "Gender": 0,
    "BornAt": "1809-01-19T00:00:00",
    "DiedAt": "1849-10-07T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "7c9d2f34-0a1b-4e57-bc62-9de5ab3f21c8",
    "Name": "James Augustine Aloysius Joyce",
    "ImagePath": "/images/authors/james-joyce.jpg",
    "Biography": "James Augustine Aloysius Joyce (February 2, 1882 – January 13, 1941) was an Irish novelist, short story writer, and poet, widely regarded as one of the most influential and innovative writers of the 20th century. Born in Dublin, Joyce drew heavily on his native city and his own life experiences to construct a body of work that revolutionized narrative form and language. Educated by Jesuits and later at University College Dublin, he became disillusioned with the social, religious, and political constraints of Ireland and spent much of his adult life in self-imposed exile in cities such as Trieste, Zurich, and Paris. Despite this physical distance, Dublin remained the central imaginative landscape of his fiction, which is known for its psychological depth, dense allusiveness, and experimental style.\n\nJoyce first gained recognition with the short story collection \"Dubliners\" (1914), a series of understated yet powerful portraits of ordinary Dubliners confronting moments of revelation or paralysis. His semi-autobiographical novel \"A Portrait of the Artist as a Young Man\" (1916) explores the intellectual and spiritual development of Stephen Dedalus, a stand-in for Joyce himself, and helped establish the modernist technique of interior monologue. Joyce's masterpiece, \"Ulysses\" (1922), reimagines Homer’s epic over the course of a single day in Dublin, employing stream of consciousness, shifting narrative perspectives, and a dazzling array of stylistic experiments to capture the inner lives of its characters. His final major work, \"Finnegans Wake\" (1939), pushes linguistic experimentation to the extreme with its dreamlike, multilingual wordplay. Though often controversial and frequently censored in his lifetime, Joyce’s work profoundly reshaped the possibilities of literary form and has had a lasting impact on modern and postmodern literature, inspiring generations of writers, critics, and scholars.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 78,
    "Gender": 0,
    "BornAt": "1882-02-02T00:00:00",
    "DiedAt": "1941-01-13T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "6a5d1c1b-8c32-4b7d-92e6-4c9b0f7e3f21",
    "Name": "Virginia Woolf",
    "ImagePath": "/images/authors/virginia-woolf.jpg",
    "Biography": "Virginia Woolf (January 25, 1882 – March 28, 1941) was an English novelist, essayist, and critic, recognized as one of the most innovative and influential modernist writers of the 20th century. Born Adeline Virginia Stephen in London, she was educated at home in a highly literary and intellectual environment, which nurtured her early passion for reading and writing. Woolf became a central figure in the Bloomsbury Group, a circle of writers, artists, and thinkers who challenged Victorian social norms and championed new ideas in art, politics, and personal freedom. Her most celebrated novels, including Mrs Dalloway (1925), To the Lighthouse (1927), and Orlando (1928), are noted for their experimental narrative techniques, stream-of-consciousness style, and deep psychological insight into characters’ inner lives. In A Room of One’s Own (1929), a seminal feminist essay, Woolf argued for women’s intellectual and economic independence, famously insisting on the importance of having ‘a room of one’s own’ and financial security to create literature. Throughout her life, she struggled with periods of mental illness, yet remained astonishingly productive, publishing novels, essays, biographies, and literary criticism that reshaped the landscape of English fiction. Woolf’s work continues to be studied, adapted, and reinterpreted, and she is widely regarded as a pioneering voice in both modernist literature and feminist thought.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 181,
    "Gender": 1,
    "BornAt": "1882-01-25T00:00:00",
    "DiedAt": "1941-03-28T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "4a5d8bc0-7c6e-4f30-9c2b-3f6e9e7ad211",
    "Name": "Haruki Murakami",
    "ImagePath": "/images/authors/haruki-murakami.jpg",
    "Biography": "Haruki Murakami (born January 12, 1949) is a Japanese novelist, essayist, and translator whose work blends elements of magical realism, surrealism, pop culture, and deeply introspective psychological themes. Born in Kyoto and raised in Kobe, Murakami initially pursued a life far from literature, studying drama at Waseda University and running a jazz bar in Tokyo with his wife, Yoko. He famously decided to begin writing fiction in his late twenties, a turning point that led to his first novel, Hear the Wind Sing, which won a newcomer’s prize and launched his literary career. His prose is known for its plain yet hypnotic style, often featuring solitary protagonists, cats, music (especially jazz and classical), and parallel realities that blur the boundary between the everyday and the uncanny.\n\nMurakami achieved international recognition with novels such as Norwegian Wood, a poignant story of love and loss that made him a literary celebrity in Japan, followed by more expansive and surreal works including The Wind-Up Bird Chronicle, Kafka on the Shore, and 1Q84. His fiction frequently explores themes of alienation, memory, identity, and the lingering effects of historical trauma, while his non-fiction—such as What I Talk About When I Talk About Running—offers insight into his disciplined creative process and long-distance running, a key part of his life. In addition to his original works, Murakami has translated authors like F. Scott Fitzgerald, Raymond Carver, and J.D. Salinger into Japanese, helping to shape Japan’s engagement with Western literature. Widely considered one of the most influential contemporary authors, he has received numerous international literary awards, and his novels have been adapted into films, stage productions, and anime, resonating with readers around the world for their emotional depth and dreamlike atmosphere.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 82,
    "Gender": 0,
    "BornAt": "1949-01-12T00:00:00",
    "DiedAt": null,
    "IsApproved": true
  },
  {
    "Id": "b9a1f6f3-0d0b-4e9c-9b5d-52b1a4f7c621",
    "Name": "Clive Staples Lewis",
    "ImagePath": "/images/authors/clive-staples-lewis.jpg",
    "Biography": "Clive Staples Lewis (November 29, 1898 – November 22, 1963) was a British writer, scholar, and Christian apologist, best known for his works of fiction such as The Chronicles of Narnia, The Screwtape Letters, and The Space Trilogy, as well as influential works of Christian theology and philosophy including Mere Christianity, The Problem of Pain, and Miracles. Born in Belfast, Ireland, Lewis showed an early love for stories and mythology, especially Norse and classical tales, which deeply influenced his later writing. He served in the British Army during World War I and was wounded in combat, an experience that left a lasting mark on his outlook. After the war, Lewis studied at the University of Oxford, where he later became a fellow and tutor in English literature at Magdalen College. A respected medieval and Renaissance scholar, he authored several academic works, including The Allegory of Love and English Literature in the Sixteenth Century. In the 1930s and 1940s, following his return to Christian faith, Lewis began writing popular theological works and became widely known for his BBC radio talks on Christianity during World War II, which later formed the basis of Mere Christianity. As a member of the literary group The Inklings, alongside J.R.R. Tolkien and others, he helped shape modern fantasy and speculative fiction. His Narnia series, beginning with The Lion, the Witch and the Wardrobe, has become a classic of children’s literature, blending fantasy, myth, and Christian symbolism. In his later years he married the American writer Joy Davidman, whose illness and death inspired his poignant reflections on grief in A Grief Observed. Lewis died in 1963 in Oxford, leaving a legacy as one of the 20th century’s most influential and widely read writers in both literature and Christian thought.",
    "PenName": "C. S. Lewis",
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 181,
    "Gender": 0,
    "BornAt": "1898-11-29T00:00:00",
    "DiedAt": "1963-11-22T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "f5d7c3e2-4a89-4a3b-bb85-42a0b9f9c321",
    "Name": "Oscar Fingal O'Flahertie Wills Wilde",
    "ImagePath": "/images/authors/oscar-wilde.jpg",
    "Biography": "Oscar Fingal O'Flahertie Wills Wilde (October 16, 1854 – November 30, 1900) was an Irish poet, playwright, novelist, and one of the most celebrated wits of the late Victorian era. Born in Dublin to an intellectual and socially prominent family, Wilde excelled at Trinity College Dublin and later at Oxford, where he developed the flamboyant personal style and sharp, epigrammatic humor that would become his trademark. A leading figure in the Aesthetic Movement, he championed the idea of 'art for art’s sake' and became famous in London society for his dazzling conversation and paradoxical aphorisms. Wilde’s most notable works include the novel The Picture of Dorian Gray and a series of acclaimed plays such as Lady Windermere’s Fan, An Ideal Husband, and his comic masterpiece The Importance of Being Earnest, which satirize social conventions, hypocrisy, and the pretensions of the upper classes. At the height of his success, Wilde’s career and reputation were shattered when he was prosecuted and imprisoned for 'gross indecency' due to his relationships with men, most notably Lord Alfred Douglas. He spent two years in prison, an experience he later reflected on in the long letter De Profundis and in the poem The Ballad of Reading Gaol. After his release, Wilde lived in relative exile in France under an assumed name, struggling with ill health and financial difficulties until his death in 1900. Despite his tragic downfall, Wilde’s works remain widely read and performed, and his wit, style, and critique of Victorian morality have secured him a lasting place in literary history.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 78,
    "Gender": 0,
    "BornAt": "1854-10-16T00:00:00",
    "DiedAt": "1900-11-30T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "f3a2b6d4-8c91-4f3e-b0a7-3b29a34c5e21",
    "Name": "Herbert George Wells",
    "ImagePath": "/images/authors/herbert-george-wells.jpg",
    "Biography": "Herbert George Wells (September 21, 1866 – August 13, 1946) was an English writer, social critic, and futurist, best known today as a founding figure of modern science fiction. Born in Bromley, Kent, into a lower-middle-class family, Wells’s early life was marked by financial hardship and an accident that left him bedridden for months, during which he developed a voracious appetite for reading. He later studied biology under T. H. Huxley, an experience that profoundly influenced his thinking about evolution, society, and the future. Wells worked as a teacher and journalist before turning to fiction, where his imaginative vision and interest in science, technology, and social change quickly set him apart.\n\nWells’s most famous works include The Time Machine, The War of the Worlds, The Invisible Man, and The Island of Doctor Moreau, novels that combined speculative scientific ideas with sharp social commentary and enduring questions about human nature, progress, and morality. His fiction often portrays ordinary individuals confronted with extraordinary events, highlighting both the promise and the peril of scientific advancement. Beyond his science fiction, Wells wrote realistic novels such as Kipps and Tono-Bungay, as well as influential works of social and political commentary, including Anticipations and The Outline of History. A committed socialist and outspoken public intellectual, he engaged passionately with issues such as class inequality, education, and the prospects for a global, cooperative civilization. Wells remained an active writer and commentator until his death in 1946, leaving a legacy that continues to shape both popular culture and serious thinking about the future.",
    "PenName": "H. G. Wells",
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 181,
    "Gender": 0,
    "BornAt": "1866-09-21T00:00:00",
    "DiedAt": "1946-08-13T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "e3d4c7a1-9f6b-4a88-bc1e-0c9f2b7d5f32",
    "Name": "Jules Verne",
    "ImagePath": "/images/authors/jules-verne.jpg",
    "Biography": "Jules Verne (February 8, 1828 – March 24, 1905) was a French novelist, playwright, and pioneer of speculative fiction, often hailed as one of the founding fathers of modern science fiction. Born in Nantes, France, Verne originally studied law in Paris to follow his father’s profession, but soon turned to literature and the theater, writing plays and librettos before dedicating himself fully to fiction. His breakthrough came with Cinq semaines en ballon (Five Weeks in a Balloon, 1863), the first of his Voyages extraordinaires, a celebrated series of adventure novels that combined meticulous research with imaginative exploration of science and technology. Among his most famous works are Voyage au centre de la Terre (Journey to the Center of the Earth, 1864), Vingt mille lieues sous les mers (Twenty Thousand Leagues Under the Seas, 1870), and Le Tour du monde en quatre-vingts jours (Around the World in Eighty Days, 1873). These stories, filled with daring expeditions, visionary inventions, and exotic locales, captured the excitement of the 19th century’s age of discovery and industrial progress. Verne’s writing anticipated submarines, space travel, and other technological marvels long before they became reality, influencing generations of readers, scientists, and writers. Despite periods of personal and financial difficulty, he remained a prolific author, producing dozens of novels and short stories. By the time of his death in Amiens, France, Verne had become a global literary figure, and his books continue to be translated, adapted, and read by audiences around the world.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 58,
    "Gender": 0,
    "BornAt": "1828-02-08T00:00:00",
    "DiedAt": "1905-03-24T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "c3c70af1-288b-4c77-9f7c-0a2e4a0eb8d2",
    "Name": "Arthur Conan Doyle",
    "ImagePath": "/images/authors/arthur-conan-doyle.jpg",
    "Biography": "Arthur Conan Doyle (22 May 1859 – 7 July 1930) was a British writer and physician, best known as the creator of Sherlock Holmes, one of the most iconic detectives in literary history. Born in Edinburgh, Scotland, Doyle studied medicine at the University of Edinburgh, where he encountered Dr. Joseph Bell, a surgeon whose keen powers of observation later inspired the character of Holmes. While practicing as a doctor, Doyle began writing short stories and novels, eventually achieving fame with A Study in Scarlet (1887), the first appearance of Holmes and his loyal friend and chronicler, Dr. John Watson. The Sherlock Holmes stories, serialized in The Strand Magazine, including The Adventures of Sherlock Holmes, The Memoirs of Sherlock Holmes, and The Hound of the Baskervilles, helped define the modern detective genre through their use of logical deduction, forensic detail, and atmospheric Victorian settings.\n\nAlthough Doyle is most celebrated for Sherlock Holmes, his literary output was extensive and diverse. He wrote historical novels such as The White Company, science fiction and adventure tales including The Lost World featuring Professor Challenger, as well as plays, essays, and poetry. A veteran of medical service in the Boer War, Doyle also wrote pamphlets and works of non-fiction, sometimes engaging in public debates on issues of the day. Later in life he became an outspoken advocate of spiritualism, devoting considerable time and energy to lectures and writings on the subject, which stirred both fascination and controversy. Doyle died in 1930 at his home in Crowborough, England, but his enduring influence on detective fiction, popular culture, and the enduring figure of Sherlock Holmes continues to shape literature, film, and television to this day.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 181,
    "Gender": 0,
    "BornAt": "1859-05-22T00:00:00",
    "DiedAt": "1930-07-07T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "c4c0c9b1-6b6d-4c3f-8f43-7c8a9f2e1b55",
    "Name": "Emily Jane Brontë",
    "ImagePath": "/images/authors/emily-bronte.jpg",
    "Biography": "Emily Jane Brontë (July 30, 1818 – December 19, 1848) was an English novelist and poet, best known for her singular and powerful novel Wuthering Heights, now regarded as a classic of English literature. Born in Thornton, Yorkshire, and raised on the remote moorlands around Haworth, Emily was one of the three literary Brontë sisters—alongside Charlotte and Anne—whose work would leave a lasting mark on Victorian fiction. Emily’s childhood was shaped by loss, isolation, and an intense imaginative life shared with her siblings, who created elaborate fictional worlds that nurtured their creativity. Publishing at a time when women writers faced significant prejudice, Emily first appeared in print under the male pseudonym Ellis Bell, as part of a joint volume of poetry with her sisters. Wuthering Heights, published in 1847, initially shocked many readers with its dark passion, complex narrative structure, and unflinching portrayal of obsession, revenge, and the destructive forces of love, set against the wild, elemental backdrop of the Yorkshire moors. Although the novel was not fully appreciated in her lifetime, its reputation grew steadily, and it is now considered one of the most original and influential works of the 19th century. Emily was famously private and deeply attached to her home and the surrounding landscape; she rarely traveled and preferred a life of quiet routine and writing. Her health declined rapidly after she contracted tuberculosis, and she died at the age of 30. Despite her brief life and small body of work, Emily Brontë’s intense, poetic vision and her only novel have secured her a permanent place in the canon of world literature.",
    "PenName": "Ellis Bell",
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 181,
    "Gender": 1,
    "BornAt": "1818-07-30T00:00:00",
    "DiedAt": "1848-12-19T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "d7a8fbb3-5c9d-4a4d-9c10-1a2b3c4d5e6f",
    "Name": "Charlotte Brontë",
    "ImagePath": "/images/authors/charlotte-bronte.jpg",
    "Biography": "Charlotte Brontë (April 21, 1816 – March 31, 1855) was an English novelist and poet, best known for her groundbreaking novel Jane Eyre. Born in Thornton, Yorkshire, and raised in the remote village of Haworth, she was the third of six children of the Reverend Patrick Brontë and his wife Maria. After the early death of their mother and two older sisters, Charlotte and her surviving siblings—Emily, Anne, and Branwell—created elaborate imaginary worlds and stories, nurturing the creativity that would later define their literary careers. Charlotte’s experiences as a student and teacher at harsh boarding schools, as well as her work as a governess, deeply influenced her portrayal of social class, gender, and moral integrity in her fiction. First published under the male pseudonym \"Currer Bell,\" Jane Eyre (1847) was an immediate success, noted for its strong, introspective heroine, its frank exploration of emotion and desire, and its critique of Victorian social and religious hypocrisy. Charlotte went on to write Shirley and Villette, novels that further explored themes of female independence, loneliness, and the struggle for self-expression within restrictive social norms. Her life, however, was marked by personal tragedy: she outlived all her siblings and died at the age of thirty-eight, shortly after marrying Arthur Bell Nicholls. Despite her brief life, Charlotte Brontë’s work has had a lasting impact on the development of the novel and on feminist literary tradition, and she remains one of the central figures of nineteenth-century English literature.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 181,
    "Gender": 1,
    "BornAt": "1816-04-21T00:00:00",
    "DiedAt": "1855-03-31T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "c8a5b9e2-1f4c-4a8d-9b73-29d62b1a3f45",
    "Name": "Herman Melville",
    "ImagePath": "/images/authors/herman-melville.jpg",
    "Biography": "Herman Melville (August 1, 1819 – September 28, 1891) was an American novelist, short story writer, and poet, best known today for his epic whaling novel Moby-Dick. Born in New York City to a once-prosperous merchant family, Melville experienced early financial instability and the death of his father, events that deeply marked his youth. As a young man, he spent several years at sea, working on merchant ships and whaling vessels in the Atlantic and Pacific Oceans. These maritime experiences provided the raw material and vivid detail that would later inform much of his fiction.\n\nMelville made his literary debut with the semi-autobiographical travel narratives Typee (1846) and Omoo (1847), which were commercially successful and established him as a popular adventure writer. Seeking greater artistic ambition, he wrote Moby-Dick (1851), a complex and symbolically rich novel that blends whaling lore, philosophical reflection, and psychological drama in the story of Captain Ahab’s obsessive pursuit of the white whale. Initially misunderstood and only modestly received, Moby-Dick is now considered one of the greatest works of American and world literature. Melville’s later novels, including Pierre, The Confidence-Man, and the posthumously published Billy Budd, often baffled contemporary readers with their experimental structure, dark themes, and moral ambiguity. During his lifetime, his reputation waned, and he spent his later years working as a customs inspector in New York while quietly writing poetry and prose. It was not until the so-called 'Melville Revival' in the early 20th century that his work was rediscovered and celebrated for its profound exploration of identity, faith, authority, and the limits of human knowledge.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 182,
    "Gender": 0,
    "BornAt": "1819-08-01T00:00:00",
    "DiedAt": "1891-09-28T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "d2e4a6b8-3c9f-4f50-9ad7-92e4c8f5b321",
    "Name": "Miguel de Cervantes Saavedra",
    "ImagePath": "/images/authors/miguel-de-cervantes-saavedra.jpg",
    "Biography": "Miguel de Cervantes Saavedra (September 29, 1547 – April 22, 1616) was a Spanish novelist, playwright, and poet, widely regarded as one of the greatest writers in world literature and a central figure of the Spanish Golden Age. Born in Alcalá de Henares, Spain, Cervantes led a turbulent life marked by military service, captivity, financial struggles, and persistent efforts to succeed as a writer. He fought as a soldier in the Battle of Lepanto in 1571, where he was severely wounded, losing the full use of his left hand. On his return voyage to Spain in 1575, he was captured by Barbary pirates and spent five years as a prisoner in Algiers before being ransomed and released. Cervantes worked variously as a civil servant and tax collector while writing plays, poetry, and prose. His masterpiece, El ingenioso hidalgo don Quijote de la Mancha (Don Quixote), published in two parts in 1605 and 1615, is often considered the first modern novel. The story of the idealistic, deluded knight-errant Don Quixote and his practical squire Sancho Panza masterfully blends comedy, satire, and profound reflection on reality, illusion, and the power of literature. Don Quixote has been translated into numerous languages, adapted across every major artistic medium, and remains one of the most influential works in Western culture. Although Cervantes struggled financially throughout his life and never enjoyed great wealth, his literary legacy has endured for centuries, securing his place as the preeminent writer in the Spanish language and a foundational figure in the history of the novel.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 160,
    "Gender": 0,
    "BornAt": "1547-09-29T00:00:00",
    "DiedAt": "1616-04-22T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "a4f0b0fb-45b8-4bde-87b3-8f0f4fe9c321",
    "Name": "Johann Wolfgang von Goethe",
    "ImagePath": "/images/authors/johann-wolfgang-von-goethe.jpg",
    "Biography": "Johann Wolfgang von Goethe (28 August 1749 – 22 March 1832) was a German writer, statesman, and polymath whose work helped shape European literature, philosophy, and culture. Born in Frankfurt am Main to a well-to-do family, Goethe showed early talent in languages and the arts. He studied law in Leipzig and Strasbourg, but his true passion was literature, and he gained fame with the novel The Sorrows of Young Werther (1774), a landmark of the Sturm und Drang movement that explored intense emotion, individualism, and the conflicts of the modern self. Goethe later became a leading figure at the court of Weimar, where he served in various administrative roles while continuing his literary and scientific pursuits.\n\nGoethe’s most celebrated work is Faust, a monumental dramatic poem that he developed over much of his life, depicting a scholar’s pact with the devil and probing themes of ambition, desire, knowledge, and redemption. His oeuvre spans poetry, drama, novels, essays, and criticism, including Wilhelm Meister’s Apprenticeship, the classical drama Iphigenia in Tauris, and the Roman Elegies. Beyond literature, Goethe made contributions to natural science, writing on botany, color theory, and geology, and engaging in wide-ranging correspondence with other thinkers of his time. His blend of artistic genius, intellectual curiosity, and philosophical depth helped define the ideals of Weimar Classicism and influenced figures from Nietzsche and Mann to modern psychologists and artists. Goethe died in Weimar in 1832, leaving a legacy as one of the central figures in Western literary and intellectual history.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 62,
    "Gender": 0,
    "BornAt": "1749-08-28T00:00:00",
    "DiedAt": "1832-03-22T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "e7b3a0a4-2f6f-4c0b-9a3f-9f5a1cb8d921",
    "Name": "Anton Pavlovich Chekhov",
    "ImagePath": "/images/authors/anton-chekhov.jpg",
    "Biography": "Anton Pavlovich Chekhov (January 29, 1860 – July 15, 1904) was a Russian playwright, short story writer, and physician, widely regarded as one of the greatest writers in world literature and a master of the modern short story. Born in Taganrog, Russia, into a struggling merchant family, Chekhov worked his way through medical school in Moscow while writing humorous sketches and short pieces for magazines, often under pseudonyms, to support his family. Over time, his fiction deepened in psychological complexity and emotional subtlety, producing landmark collections such as In the Ravine, The Lady with the Dog, and Ward No. 6, which combined concise prose with profound insight into human behavior, loneliness, and moral ambiguity. As a dramatist, Chekhov revolutionized theatre with plays like The Seagull, Uncle Vanya, Three Sisters, and The Cherry Orchard, collaborating with director Konstantin Stanislavski and the Moscow Art Theatre to pioneer a new, more naturalistic style of performance that emphasized subtext, everyday speech, and the quiet tensions of ordinary life. Although he continued to practice medicine throughout much of his career—famously saying that “medicine is my lawful wife and literature my mistress”—his health was fragile, and he suffered from tuberculosis for many years. Chekhov died at the age of 44 in Badenweiler, Germany, but his plays and stories have had a lasting influence on modern drama, narrative technique, and character-driven storytelling, shaping generations of writers, directors, and actors.",
    "PenName": "Antosha Chekhonte",
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 140,
    "Gender": 0,
    "BornAt": "1860-01-29T00:00:00",
    "DiedAt": "1904-07-15T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "8c3f0a41-2d7a-4f76-936a-2e4a9f9b7c52",
    "Name": "Chloe Anthony Wofford Morrison",
    "ImagePath": "/images/authors/toni-morrison.jpg",
    "Biography": "Chloe Anthony Wofford Morrison (February 18, 1931 – August 5, 2019), known professionally as Toni Morrison, was an American novelist, essayist, editor, and professor whose work reshaped the landscape of contemporary literature. Born in Lorain, Ohio, to a working-class African American family, she grew up immersed in stories, folklore, and music that later informed the rich oral quality of her prose. After studying at Howard University and Cornell University, Morrison worked as an editor at Random House, where she played a crucial role in bringing Black voices and perspectives into mainstream American publishing. As an author, she is best known for novels such as The Bluest Eye, Sula, Song of Solomon, and Beloved, works that confront the legacies of slavery, racism, and sexism while exploring themes of memory, community, identity, and the struggle for self-definition. Her writing is celebrated for its lyrical language, psychological depth, and complex narrative structures, as well as its uncompromising focus on the inner lives and histories of Black Americans, particularly Black women. Morrison received the Pulitzer Prize for Fiction in 1988 for Beloved and, in 1993, became the first African American woman to be awarded the Nobel Prize in Literature, honored for her visionary force and poetic intensity. She also taught at several universities, most notably Princeton, influencing generations of students and writers. Until her death in 2019, Morrison remained a vital public intellectual, speaking and writing about literature, politics, and the moral responsibilities of art. Her legacy endures in her body of work, which continues to challenge, move, and inspire readers around the world.",
    "PenName": "Toni Morrison",
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 182,
    "Gender": 1,
    "BornAt": "1931-02-18T00:00:00",
    "DiedAt": "2019-08-05T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "a4f8c9d3-2b17-4a6e-9e52-3c7d1b8e4f90",
    "Name": "Chinua Achebe",
    "ImagePath": "/images/authors/chinua-achebe.jpg",
    "Biography": "Chinua Achebe (November 16, 1930 – March 21, 2013) was a Nigerian novelist, poet, essayist, and critic, widely regarded as the father of modern African literature. Born in Ogidi, in what is now Anambra State, Nigeria, to Christian parents who were deeply rooted in Igbo culture, Achebe grew up at the intersection of traditional African life and the influences of British colonialism and Christian missionary education. He studied at University College Ibadan (then affiliated with the University of London), where he developed a strong interest in literature and began to rethink the ways Africa and Africans were portrayed in English-language writing. After graduating, Achebe worked for the Nigerian Broadcasting Corporation while continuing to write fiction and essays that questioned colonial narratives and reclaimed African perspectives.\n\nAchebe achieved international fame with his debut novel, \"Things Fall Apart\" (1958), a landmark work that examines the breakdown of Igbo society under the impact of colonial rule and Christian missionaries through the tragic story of Okonkwo, a proud village leader. The novel has sold millions of copies, been translated into dozens of languages, and is considered one of the most important books of the 20th century. Achebe went on to write other significant novels, including \"No Longer at Ease,\" \"Arrow of God,\" \"A Man of the People,\" and \"Anthills of the Savannah,\" as well as influential essays and lectures that critiqued racist and reductionist depictions of Africa in Western literature—most famously in his essay on Joseph Conrad’s \"Heart of Darkness.\" A committed public intellectual and advocate for social justice, Achebe played an active role during the Nigerian Civil War, supported the Biafran cause, and later held academic posts at universities in Nigeria, the United States, and elsewhere. His final major work, the memoir \"There Was a Country,\" reflects on the war and its lasting impact. Achebe’s legacy endures in his profound reshaping of how African stories are told and understood, inspiring generations of writers across the continent and around the world.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 125,
    "Gender": 0,
    "BornAt": "1930-11-16T00:00:00",
    "DiedAt": "2013-03-21T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "f7c9b4d2-1e3a-4c8b-9f45-2a6d3e9b7c10",
    "Name": "Marcel Proust",
    "ImagePath": "/images/authors/marcel-proust.jpg",
    "Biography": "Marcel Proust (July 10, 1871 – November 18, 1922) was a French novelist, essayist, and critic, best known for his monumental seven-volume work À la recherche du temps perdu (In Search of Lost Time), often regarded as one of the greatest achievements in modern literature. Born in Auteuil, near Paris, into a well-to-do bourgeois family, Proust was frail and frequently ill from childhood, suffering from chronic asthma. Despite intermittent studies in law and philosophy, he gravitated toward the literary and social worlds of Paris, becoming a keen observer of high society, salons, and the subtle codes of class and behavior that would later permeate his fiction. In Search of Lost Time, published between 1913 and 1927, blends autobiography, fiction, and philosophical reflection in an intricate exploration of memory, time, desire, art, and the nature of consciousness. The novel’s famous madeleine episode, in which a taste triggers a flood of involuntary memories, has become emblematic of Proust’s unique narrative technique. His style is distinguished by extraordinarily long, finely modulated sentences and an almost microscopic psychological insight into characters’ inner lives and social interactions. Though his early work received limited recognition, Proust’s reputation grew steadily after the publication of the first volumes of In Search of Lost Time, and he was awarded the prestigious Prix Goncourt in 1919 for À l’ombre des jeunes filles en fleurs (Within a Budding Grove). Proust spent his final years largely confined to his cork-lined bedroom, obsessively revising and expanding his manuscript. He died in 1922 before the final volumes were published, but his work has since exerted profound influence on 20th-century literature, philosophy, and critical theory.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 58,
    "Gender": 0,
    "BornAt": "1871-07-10T00:00:00",
    "DiedAt": "1922-11-18T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "e7a4e2b9-3fb0-4a81-8c0e-7c9a4d7f5b21",
    "Name": "Mary Wollstonecraft Shelley",
    "ImagePath": "/images/authors/mary-shelley.jpg",
    "Biography": "Mary Wollstonecraft Shelley (30 August 1797 – 1 February 1851) was an English novelist, editor, and travel writer, best known as the author of Frankenstein; or, The Modern Prometheus, a cornerstone of both Gothic literature and early science fiction. Born in London to the philosopher William Godwin and the pioneering feminist writer Mary Wollstonecraft, she grew up in an intellectually vibrant but emotionally complex household. Her mother died shortly after her birth, and Mary educated herself through extensive reading among her father’s radical literary circle. In 1814 she began a relationship with the Romantic poet Percy Bysshe Shelley, eloping with him to the Continent; their unconventional partnership, marred by financial difficulties and personal tragedy, deeply influenced her writing.\n\nThe idea for Frankenstein famously arose during the summer of 1816 near Lake Geneva, when Mary, Percy Shelley, Lord Byron, and others challenged one another to write ghost stories. Published anonymously in 1818 and revised in 1831, the novel tells the story of Victor Frankenstein, a scientist who creates a living being only to recoil from his own work, exploring themes of creation and responsibility, alienation, scientific ambition, and the boundaries of humanity. Beyond Frankenstein, Mary Shelley wrote several other novels, including The Last Man, a dystopian plague narrative; Valperga; and Lodore, as well as short stories, biographies, and travelogues such as Rambles in Germany and Italy. After Percy Shelley’s death in 1822, she devoted herself to preserving and editing his literary legacy while continuing to write to support herself and her son. Mary Shelley died in London in 1851, but her most famous work remains a powerful cultural touchstone, inspiring countless adaptations and continuing debates about ethics, technology, and what it means to be human.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 181,
    "Gender": 1,
    "BornAt": "1797-08-30T00:00:00",
    "DiedAt": "1851-02-01T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "a9c2d1e4-7f3b-4c51-9a2e-6b4d8a9f1234",
    "Name": "Louisa May Alcott",
    "ImagePath": "/images/authors/louisa-may-alcott.jpg",
    "Biography": "Louisa May Alcott (November 29, 1832 – March 6, 1888) was an American novelist, short story writer, and poet, best known for her beloved novel Little Women and its sequels. Born in Germantown, Pennsylvania, and raised primarily in Boston and Concord, Massachusetts, she grew up in an intellectually vibrant yet financially strained household. Her father, the educator and transcendentalist Bronson Alcott, and her mother, social worker and reformer Abigail May Alcott, were close to figures such as Ralph Waldo Emerson and Henry David Thoreau, whose ideas deeply influenced Louisa’s outlook. From an early age she helped support her family by working as a teacher, seamstress, governess, and writer of sensational stories, some published under the pseudonym A. M. Barnard. During the American Civil War she served as a nurse in a Union hospital in Washington, D.C., an experience she later transformed into the memoir Hospital Sketches. Her breakthrough came with Little Women (1868–1869), a semi-autobiographical novel about the March sisters—Meg, Jo, Beth, and Amy—which captured the joys and trials of girlhood and family life with warmth, humor, and moral insight. The book’s success led to sequels including Little Men and Jo’s Boys, and established Alcott as one of the most popular authors of her time. Beyond her fiction, she was an outspoken advocate for abolition, women’s suffrage, and educational reform, often contributing essays and stories to support these causes. Despite chronic health problems later in life, likely aggravated by illnesses contracted during the war, she continued to write and manage her family’s affairs. Alcott died in 1888 in Boston, but her work—especially Little Women—remains a cornerstone of children’s and young adult literature, inspiring countless adaptations and readers around the world.",
    "PenName": "A. M. Barnard",
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 182,
    "Gender": 1,
    "BornAt": "1832-11-29T00:00:00",
    "DiedAt": "1888-03-06T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "3fd8c1a2-9a6b-4d2b-b8b7-5c4e7b92d0af",
    "Name": "Ray Douglas Bradbury",
    "ImagePath": "/images/authors/ray-bradbury.jpg",
    "Biography": "Ray Douglas Bradbury (August 22, 1920 – June 5, 2012) was an American author and screenwriter whose imaginative, lyrical storytelling helped elevate science fiction and fantasy into the literary mainstream. Born in Waukegan, Illinois, Bradbury developed an early love of reading, films, and pulp magazines, all of which fueled his vivid sense of wonder and curiosity about the future, technology, and the human condition. He moved with his family to Los Angeles during the Great Depression, where he educated himself in local libraries and began publishing short stories in the 1940s. Bradbury’s best-known works include the novel Fahrenheit 451, a dystopian vision of a society where books are banned and critical thought is suppressed, and The Martian Chronicles, a linked collection of stories about human colonization of Mars that explores themes of nostalgia, colonization, and cultural conflict. Other notable books include The Illustrated Man, Dandelion Wine, and Something Wicked This Way Comes. Although often labeled a science fiction writer, Bradbury himself emphasized that he was primarily a fantasist and moral storyteller, more interested in people, memory, and emotion than in scientific accuracy. His poetic prose, memorable imagery, and cautionary tales about censorship, conformity, and dehumanizing technology have left an enduring mark on literature and popular culture. Over his long career, Bradbury wrote hundreds of short stories, novels, plays, screenplays, and teleplays, and he received numerous honors, including a Pulitzer Prize Special Citation in 2007. He remained an enthusiastic advocate for libraries, imagination, and the power of reading throughout his life, inspiring generations of readers and writers.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 182,
    "Gender": 0,
    "BornAt": "1920-08-22T00:00:00",
    "DiedAt": "2012-06-05T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "d1f7b2a3-5c48-4c0c-87e5-9a3f6db2f912",
    "Name": "Isaac Asimov",
    "ImagePath": "/images/authors/isaac-asimov.jpg",
    "Biography": "Isaac Asimov (January 2, 1920 – April 6, 1992) was an American writer and biochemistry professor, best known as one of the most prolific and influential authors of science fiction and popular science in the 20th century. Born in Petrovichi, in what is now Russia, to a Jewish family that emigrated to the United States when he was a child, Asimov grew up in Brooklyn, New York. A voracious reader with a deep love of science and literature, he earned a Ph.D. in biochemistry from Columbia University and later taught at Boston University, though his true passion was writing. Over the course of his career, he wrote or edited hundreds of books and thousands of essays on topics ranging from physics and history to the Bible and Shakespeare, making complex subjects accessible to general audiences.\n\nAsimov is particularly renowned for his contributions to science fiction, especially the Foundation series, the Robot stories, and the Galactic Empire novels, which together form an expansive future history of humanity and its interactions with intelligent machines and galactic civilizations. His Robot stories introduced the famous Three Laws of Robotics, a conceptual framework that has had a lasting impact on both science fiction and real-world discussions about artificial intelligence and ethics. The Foundation series, beginning with the novel \"Foundation,\" explores the use of a fictional science called psychohistory to predict and shape the future of a vast galactic empire. Asimov’s fiction is noted for its emphasis on ideas, rational problem-solving, and scientific optimism rather than on space opera spectacle. In addition to his imaginative storytelling, his clear, engaging style in popular science books helped inspire generations of readers to take an interest in science and technology. Asimov continued writing almost until his death in 1992, leaving behind a legacy that continues to shape both speculative fiction and public understanding of science.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 182,
    "Gender": 0,
    "BornAt": "1920-01-02T00:00:00",
    "DiedAt": "1992-04-06T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "a9d3f5c2-4b7e-4a1f-9c28-3f6e9d2b7811",
    "Name": "Aldous Huxley",
    "ImagePath": "/images/authors/aldous-huxley.jpg",
    "Biography": "Aldous Huxley (July 26, 1894 – November 22, 1963) was an English novelist, essayist, and critic, renowned for his probing explorations of science, society, and the human psyche. Born in Godalming, Surrey, into a prominent intellectual family that included the biologist Thomas Henry Huxley and, later, his brother, the Nobel Prize–winning biologist Julian Huxley, he was steeped in scientific and literary culture from an early age. A serious eye disease in his youth permanently impaired his vision and curtailed his plans for a medical career, turning him instead toward literature. Huxley’s early novels, such as Crome Yellow (1921), Antic Hay (1923), and Point Counter Point (1928), satirize the manners, morals, and intellectual fashions of post–World War I society. His most famous work, Brave New World (1932), is a dystopian novel that imagines a technologically advanced but dehumanized future, raising enduring questions about freedom, conformity, consumerism, and the cost of stability. Later in life, Huxley became increasingly interested in mysticism, spirituality, and altered states of consciousness, themes he explored in works like The Doors of Perception (1954) and Island (1962), a utopian counterpoint to Brave New World. He spent much of his later career in the United States, particularly in California, where he wrote screenplays, essays, and further fiction. Huxley’s blend of sharp satire, philosophical reflection, and speculative imagination has ensured his place as one of the most influential thinkers and writers of the 20th century.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 181,
    "Gender": 0,
    "BornAt": "1894-07-26T00:00:00",
    "DiedAt": "1963-11-22T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "d8b0c3e5-9a4a-4c6f-9f4d-1e72b2a4e517",
    "Name": "Kurt Vonnegut",
    "ImagePath": "/images/authors/kurt-vonnegut.jpg",
    "Biography": "Kurt Vonnegut (November 11, 1922 – April 11, 2007) was an American novelist, short story writer, and essayist whose darkly comic, satirical, and humanistic works made him one of the most distinctive voices in 20th-century literature. Born in Indianapolis, Indiana, to a family of German-American heritage, Vonnegut studied at Cornell University before serving in the U.S. Army during World War II. He was captured by German forces and survived the Allied firebombing of Dresden as a prisoner of war, an experience that profoundly shaped his worldview and later became the basis for his seminal anti-war novel Slaughterhouse-Five. After the war, he worked in public relations for General Electric and wrote fiction on the side, gradually establishing himself as a writer with a unique blend of science fiction, absurdism, and moral concern.\n\nVonnegut’s major works include Player Piano, The Sirens of Titan, Mother Night, Cat’s Cradle, God Bless You, Mr. Rosewater, and Slaughterhouse-Five, as well as later novels such as Breakfast of Champions, Galápagos, and Bluebeard. His writing often features nonlinear narratives, metafictional devices, and recurring characters like the science-fiction author Kilgore Trout, all used to explore themes of free will, war, technology, bureaucracy, and the search for meaning in an often indifferent universe. Vonnegut’s trademark blend of gallows humor and compassion, encapsulated in his recurring phrase “So it goes,” endeared him to generations of readers and solidified his status as a countercultural icon. In addition to his novels, he published collections of short stories and essays, including Welcome to the Monkey House and Palm Sunday, and he remained an outspoken commentator on politics, ethics, and the human condition throughout his life. Vonnegut died in New York City in 2007, leaving behind a body of work that continues to challenge, entertain, and provoke reflection.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 182,
    "Gender": 0,
    "BornAt": "1922-11-11T00:00:00",
    "DiedAt": "2007-04-11T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "d3c71a51-2b0f-4a4d-9c65-3c3f6719a8f2",
    "Name": "George Raymond Richard Martin",
    "ImagePath": "/images/authors/george-raymond-richard-martin.jpg",
    "Biography": "George Raymond Richard Martin (born September 20, 1948) is an American novelist, short story writer, and television producer, best known as the author of the epic fantasy series A Song of Ice and Fire, which inspired the acclaimed HBO television adaptation Game of Thrones. Born in Bayonne, New Jersey, Martin grew up in a working-class family and developed an early love for reading and imaginative storytelling, particularly science fiction, fantasy, and comic books. He began writing and selling monster stories to neighborhood children, later earning a journalism degree from Northwestern University. Martin first gained recognition in the 1970s and 1980s as a writer of science fiction, horror, and fantasy short stories and novellas, as well as novels such as Dying of the Light and Fevre Dream. He also worked extensively in television, contributing to series like The Twilight Zone and Beauty and the Beast, which honed his skills in character-driven drama and complex plotting.\n\nIn 1996, Martin published A Game of Thrones, the first volume in A Song of Ice and Fire, a sprawling fantasy saga set in the fictional continents of Westeros and Essos. The series, noted for its morally ambiguous characters, intricate political intrigue, and willingness to subvert traditional fantasy tropes, continued with A Clash of Kings, A Storm of Swords, A Feast for Crows, and A Dance with Dragons, earning him a vast global readership and numerous awards. The HBO adaptation, which premiered in 2011, brought his work to an even wider audience and became a cultural phenomenon, though the television storyline eventually moved beyond the published books. Beyond A Song of Ice and Fire, Martin has edited influential anthologies such as the Wild Cards shared-universe series and authored a wide range of short fiction. Known for his meticulous world-building and emotionally resonant storytelling, he has received multiple Hugo, Nebula, and Locus awards. Martin lives in Santa Fe, New Mexico, where he continues to write and oversee various projects set in his richly imagined worlds.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 182,
    "Gender": 0,
    "BornAt": "1948-09-20T00:00:00",
    "DiedAt": null,
    "IsApproved": true
  },
  {
    "Id": "6b9d4f3e-2c71-4a8a-9b6a-0f7c2e5d9a34",
    "Name": "Paulo Coelho",
    "ImagePath": "/images/authors/paulo-coelho.jpg",
    "Biography": "Paulo Coelho (born August 24, 1947) is a Brazilian novelist and lyricist whose spiritually infused, allegorical fiction has made him one of the most widely read authors in the world. Born in Rio de Janeiro, he initially pursued a career in music and theater, working as a songwriter and collaborating with some of Brazil’s most famous musicians during the 1970s. After a period of personal crisis, travel, and reflection—including a famous pilgrimage along the Camino de Santiago in Spain—Coelho turned decisively to writing. His breakthrough novel, The Alchemist, first published in 1988, follows a young shepherd on a journey in search of his \"Personal Legend\" and has sold tens of millions of copies globally, becoming a modern classic of inspirational literature. Coelho’s other notable works include Brida, Veronika Decides to Die, The Valkyries, Eleven Minutes, and The Devil and Miss Prym, many of which explore themes of destiny, faith, love, self-discovery, and the tension between spiritual yearning and everyday life. His simple, parable-like style and focus on universal questions have earned him a vast international readership, with his books translated into dozens of languages. In addition to his novels, Coelho is known for his active engagement with readers through interviews, essays, and social media, where he often shares reflections on creativity, courage, and the pursuit of one’s dreams. He continues to write and publish, maintaining a significant presence in contemporary world literature.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 24,
    "Gender": 0,
    "BornAt": "1947-08-24T00:00:00",
    "DiedAt": null,
    "IsApproved": true
  },
  {
    "Id": "5a9c4b72-0f3d-4c1e-9c62-3b71e4a8f210",
    "Name": "Roald Dahl",
    "ImagePath": "/images/authors/roald-dahl.jpg",
    "Biography": "Roald Dahl (September 13, 1916 – November 23, 1990) was a British novelist, short story writer, and screenwriter, best known for his imaginative and often darkly humorous children’s books. Born in Llandaff, Wales, to Norwegian immigrant parents, Dahl had a childhood marked by strict boarding schools and early loss, experiences that would later inform his depictions of cruel adults and resilient, resourceful children. During World War II, he served as a fighter pilot in the Royal Air Force, surviving a near-fatal crash in North Africa before being reassigned to diplomatic and intelligence work in Washington, D.C. His early writing career began with stories inspired by his wartime experiences, but he soon turned to fiction for younger readers, where his unusual blend of whimsy, grotesque comedy, and moral clarity found a massive audience.\n\nDahl’s most famous works for children include \"Charlie and the Chocolate Factory,\" \"Matilda,\" \"James and the Giant Peach,\" \"The BFG,\" \"The Witches,\" and \"Fantastic Mr Fox.\" These stories often feature mistreated or misunderstood young protagonists who use courage, cleverness, and a sense of justice to overcome tyrannical adults and absurd situations. His distinctive narrative voice—by turns mischievous, conspiratorial, and sharply satirical—helped redefine children’s literature, appealing to both young readers and the adults who read to them. In addition to his children’s books, Dahl wrote macabre short stories for adults, many of which were adapted for television in the series \"Tales of the Unexpected,\" as well as screenplays, including contributions to the James Bond film \"You Only Live Twice\" and the adaptation of Ian Fleming’s \"Chitty Chitty Bang Bang.\" Though some aspects of his life and views have sparked controversy, his books remain widely read and frequently adapted for stage and screen. Dahl’s enduring legacy lies in his ability to blend fantasy and fright with warmth and wit, creating stories that continue to captivate and challenge readers around the world.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 181,
    "Gender": 0,
    "BornAt": "1916-09-13T00:00:00",
    "DiedAt": "1990-11-23T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "c4f7e2a1-3b98-4b6f-9d21-8f0a7c3d5e42",
    "Name": "Theodor Seuss Geisel",
    "ImagePath": "/images/authors/theodor-seuss-geisel.jpg",
    "Biography": "Theodor Seuss Geisel (March 2, 1904 – September 24, 1991), known worldwide by his pen name Dr. Seuss, was an American author, cartoonist, and filmmaker whose imaginative children’s books have become classics of 20th-century literature. Born in Springfield, Massachusetts, Geisel began his career as a cartoonist and advertising illustrator before turning to children’s literature. His breakthrough came with the publication of And to Think That I Saw It on Mulberry Street (1937), but it was The Cat in the Hat (1957), written using a limited vocabulary to support early readers, that cemented his reputation as a transformative figure in children’s books. Over his career, he wrote and illustrated more than 60 books, including Green Eggs and Ham, How the Grinch Stole Christmas!, Horton Hears a Who!, and Oh, the Places You’ll Go!. His work is distinguished by playful rhymes, inventive wordplay, whimsical creatures, and fantastical landscapes, all of which encourage children to delight in language and imagination. Beneath their humor and nonsense, many of his stories explore themes such as environmentalism, tolerance, responsibility, and the dangers of prejudice and authoritarianism. Geisel also contributed to wartime propaganda and educational films during World War II and later won Academy Awards for his work in animated shorts and documentaries. Though aspects of his early work and imagery have been reassessed and criticized for racial and cultural stereotyping, Dr. Seuss remains one of the most influential and widely read children’s authors in history, with his books continuing to inspire generations of young readers.",
    "PenName": "Dr. Seuss",
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 182,
    "Gender": 0,
    "BornAt": "1904-03-02T00:00:00",
    "DiedAt": "1991-09-24T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "0f9c2cba-3ad1-4d72-9f3e-5a0d2ccf8b11",
    "Name": "Neil Gaiman",
    "ImagePath": "/images/authors/neil-gaiman.jpg",
    "Biography": "Neil Gaiman (born November 10, 1960) is an English author of novels, short stories, graphic novels, comics, children’s books, and screenplays, widely recognized for his imaginative storytelling and seamless blending of myth, fantasy, and contemporary life. Born in Portchester, Hampshire, and raised in a Jewish family, Gaiman was an avid reader from an early age, drawing inspiration from writers such as J.R.R. Tolkien, C.S. Lewis, and Ursula K. Le Guin. He began his career as a journalist and critic before moving into comics in the 1980s, where he achieved international acclaim with The Sandman, a groundbreaking series that helped redefine the potential of the medium with its literary depth, mythological scope, and complex characters. The Sandman’s mix of horror, fantasy, history, and philosophical reflection established Gaiman as a central figure in modern speculative fiction.\n\nBeyond comics, Gaiman has written numerous celebrated prose works, including the novels American Gods, Neverwhere, Stardust, Anansi Boys, and The Ocean at the End of the Lane, as well as the children’s and young adult books Coraline, The Graveyard Book, and Fortunately, the Milk. His fiction often explores the intersection of the mundane and the magical, the power of stories, and the resilience of flawed, human characters in strange circumstances. Many of his works have been adapted into films, television series, radio dramas, and stage productions, including Coraline, Stardust, Good Omens (co-written with Terry Pratchett), and an acclaimed adaptation of The Sandman. Gaiman is also known for his engaging public presence, frequent talks and essays on creativity and the arts, and his advocacy for libraries, literacy, and the freedom to read. His numerous awards include the Hugo, Nebula, Bram Stoker, Newbery, and Carnegie Medals, underscoring his influence across both genre and age categories. He continues to write and collaborate across multiple media, enchanting readers and audiences around the world with his distinctive, myth-infused voice.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 181,
    "Gender": 0,
    "BornAt": "1960-11-10T00:00:00",
    "DiedAt": null,
    "IsApproved": true
  },
  {
    "Id": "b13b28b7-8bb0-4a93-9a5d-4b2b3c4f91ef",
    "Name": "William Cuthbert Faulkner",
    "ImagePath": "/images/authors/william-faulkner.jpg",
    "Biography": "William Cuthbert Faulkner (September 25, 1897 – July 6, 1962) was an American novelist, short story writer, and essayist, widely regarded as one of the most important figures in 20th-century literature. Born in New Albany, Mississippi, and raised in Oxford, Faulkner set most of his works in the fictional Yoknapatawpha County, a richly imagined version of the American South whose tangled histories, families, and communities form an interconnected literary universe. His writing is known for its experimental narrative techniques, including stream of consciousness, shifting perspectives, fragmented chronology, and dense, layered prose. Major works such as The Sound and the Fury (1929), As I Lay Dying (1930), Light in August (1932), and Absalom, Absalom! (1936) probe themes of memory, identity, race, guilt, and the legacy of slavery and the Civil War in the modern South. In addition to his novels, Faulkner wrote numerous short stories, several of which—like “A Rose for Emily” and “Barn Burning”—are considered masterpieces of the form. He worked intermittently as a Hollywood screenwriter, which provided financial stability while he continued his literary projects. Faulkner was awarded the Nobel Prize in Literature in 1949 for his powerful and artistically unique contribution to the modern American novel, and he received two Pulitzer Prizes for Fiction for A Fable (1954) and The Reivers (1962). His innovative approach to narrative and his deep psychological insight have had a lasting influence on writers around the world, securing his place as a central figure in modernist and Southern literature.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 182,
    "Gender": 0,
    "BornAt": "1897-09-25T00:00:00",
    "DiedAt": "1962-07-06T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "5f3f1b71-8c4a-4c39-9b56-3f0b322e4c19",
    "Name": "Thomas Hardy",
    "ImagePath": "/images/authors/thomas-hardy.jpg",
    "Biography": "Thomas Hardy (2 June 1840 – 11 January 1928) was an English novelist and poet whose works bridge the Victorian and modern eras, known for their stark realism, tragic intensity, and penetrating critiques of social constraints. Born in the hamlet of Higher Bockhampton in Dorset, Hardy grew up in a rural, working-class family and was apprenticed to an architect before turning to literature. The landscapes and communities of his native Wessex—a fictionalized version of southwest England—would become the backdrop for most of his fiction, shaping his distinctive blend of regional detail, social observation, and philosophical pessimism. His early novels, including Far from the Madding Crowd, brought him critical attention for their vivid characters and portrayal of rural life in a period of rapid industrial and social change.\n\nHardy’s major novels, such as The Mayor of Casterbridge, Tess of the d’Urbervilles, and Jude the Obscure, explore themes of fate, class, sexuality, and the often cruel indifference of society and nature to individual suffering. His frank treatment of moral hypocrisy, religious doubt, and the limited options available to women in Victorian England provoked controversy, with Jude the Obscure in particular drawing outrage for its perceived irreverence and bleakness. Disillusioned by the harsh critical reception of his later novels, Hardy largely abandoned long fiction and devoted the rest of his career to poetry, producing extensive collections that further developed his meditations on memory, loss, love, and the passage of time. By the time of his death in 1928, he was widely recognized as one of England’s greatest writers, and his novels and poems continue to be studied and admired for their emotional power, moral complexity, and evocative portrayal of the English countryside.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 181,
    "Gender": 0,
    "BornAt": "1840-06-02T00:00:00",
    "DiedAt": "1928-01-11T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "f85f1c5a-85b8-4cfa-b7f4-4c2fbb0dfb0e",
    "Name": "Nathaniel Hawthorne",
    "ImagePath": "/images/authors/nathaniel-hawthorne.jpg",
    "Biography": "Nathaniel Hawthorne (July 4, 1804 – May 19, 1864) was an American novelist and short story writer whose works are central to the canon of 19th-century American literature. Born in Salem, Massachusetts, into a family with deep New England Puritan roots, Hawthorne was profoundly influenced by the legacy of his ancestors, including a judge involved in the Salem witch trials. This heritage, along with his introspective nature, shaped his enduring preoccupation with guilt, sin, moral ambiguity, and the darker aspects of human consciousness. After graduating from Bowdoin College, where he formed friendships with future political and literary figures such as Henry Wadsworth Longfellow and Franklin Pierce, Hawthorne spent years in relative obscurity, refining his craft through short stories and sketches published in magazines and annuals. His early works were collected in volumes such as Twice-Told Tales and Mosses from an Old Manse. Hawthorne achieved lasting fame with novels including The Scarlet Letter, a powerful exploration of sin, shame, and resilience in Puritan New England; The House of the Seven Gables, a gothic tale of inherited guilt and family curses; and The Blithedale Romance, inspired in part by his brief involvement with the Transcendentalist communal experiment at Brook Farm. He also wrote The Marble Faun, a novel set in Italy that reflects his interest in art, history, and moral complexity. In addition to his literary pursuits, Hawthorne held various government posts, including a consulship in Liverpool, England, during Franklin Pierce’s presidency. He spent several years abroad in England and Italy before returning to New England in declining health. Hawthorne died in 1864 during a trip through New Hampshire. His richly symbolic, psychologically nuanced fiction continues to be studied and read worldwide, securing his reputation as one of America’s most important and original writers.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 182,
    "Gender": 0,
    "BornAt": "1804-07-04T00:00:00",
    "DiedAt": "1864-05-19T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "9e2f1c84-7b3a-4f1f-9d6b-2c4a8e7d5b91",
    "Name": "Henry James",
    "ImagePath": "/images/authors/henry-james.jpg",
    "Biography": "Henry James (April 15, 1843 – February 28, 1916) was an American-born British novelist, critic, and essayist, widely regarded as one of the most important figures in the development of literary realism and psychological fiction. Born into an intellectually prominent family in New York City, he spent much of his life traveling and eventually settled in Europe, living mainly in England and becoming a British subject in 1915. James’s work is known for its subtle, intricate prose, its focus on consciousness and perception, and its exploration of the moral and emotional complexities of social life. Many of his novels and stories revolve around encounters between Americans and Europeans, using this contrast to examine issues of innocence and experience, freedom and social constraint, and the nature of personal responsibility. Among his best-known works are The Portrait of a Lady, The Wings of the Dove, The Ambassadors, and The Golden Bowl, as well as the novellas Daisy Miller and The Turn of the Screw. In addition to his fiction, James was a prolific critic and essayist, writing influential reflections on the art of the novel and on other writers. His late style, characterized by long, elaborate sentences and deep interiority, challenged readers but profoundly influenced modernist authors such as Virginia Woolf and James Joyce. Though his popularity fluctuated during his lifetime, James is now recognized as a central figure in English-language literature, celebrated for his psychological insight, formal innovation, and enduring portrayals of moral ambiguity and inner life.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 182,
    "Gender": 0,
    "BornAt": "1843-04-15T00:00:00",
    "DiedAt": "1916-02-28T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "3f8a0c52-6c01-4c94-9a6f-4bd92fb02e11",
    "Name": "David Herbert Lawrence",
    "ImagePath": "/images/authors/david-herbert-lawrence.jpg",
    "Biography": "David Herbert Lawrence (September 11, 1885 – March 2, 1930) was an English novelist, poet, essayist, and critic whose work challenged the social, moral, and sexual conventions of his time. Born in Eastwood, Nottinghamshire, to a coal miner father and a former schoolteacher mother, Lawrence grew up acutely aware of class tensions and the emotional constraints of industrial life—experiences that would deeply inform his fiction. Frail as a child but intellectually gifted, he earned a scholarship, became a teacher, and began writing in his spare time. His early novels, including Sons and Lovers, draw heavily on his own family life and the psychological complexities of relationships shaped by class, desire, and emotional dependence.\n\nLawrence’s most controversial works, such as The Rainbow and Women in Love, pushed further into explorations of sexuality, individual freedom, and the search for authentic human connection in an alienating modern world. His frank treatment of sex and critique of industrial society led to censorship and public scandal, culminating in the famous obscenity trials surrounding Lady Chatterley’s Lover, which was banned in several countries for decades. Beyond his novels, Lawrence was a prolific writer of poetry, short stories, travel books, and critical essays, many of which express his distrust of mechanized, materialistic culture and his belief in the importance of instinct, intuition, and the vitality of the body. He lived much of his later life in self-imposed exile, traveling widely in Europe, Mexico, and the United States with his wife, Frieda, in search of healthier climates and more congenial intellectual surroundings.\n\nAfflicted with tuberculosis, Lawrence died at the age of 44 in Vence, France, but his reputation grew significantly after his death. Today he is recognized as a central figure of modernist literature, admired for his psychological insight, experimental style, and fearless engagement with taboo subjects. His works continue to provoke debate and inspire new readings, particularly in discussions of sexuality, gender, power, and the impact of industrial modernity on the human spirit.",
    "PenName": "D. H. Lawrence",
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 181,
    "Gender": 0,
    "BornAt": "1885-09-11T00:00:00",
    "DiedAt": "1930-03-02T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "e8c2f7b1-4a3d-4a6c-b8f1-29f0d2c7a911",
    "Name": "Mary Ann Evans",
    "ImagePath": "/images/authors/mary-ann-evans.jpg",
    "Biography": "Mary Ann Evans (November 22, 1819 – December 22, 1880), better known by her pen name George Eliot, was an English novelist, poet, and essayist, celebrated as one of the foremost writers of the Victorian era. Born in Nuneaton, Warwickshire, she received an extensive but informal education and developed an early passion for theology, philosophy, and literature. After moving to Coventry and later to London, Evans worked as a translator and journalist, eventually becoming an editor at the Westminster Review, a prominent intellectual journal. Adopting the pseudonym George Eliot to ensure her work would be taken seriously in a male-dominated literary world—and to avoid scandal due to her unconventional personal life—she published a series of novels that combined psychological depth, moral complexity, and richly observed social settings. Her major works include Adam Bede (1859), The Mill on the Floss (1860), Silas Marner (1861), Romola (1862–1863), Middlemarch (1871–1872), and Daniel Deronda (1876). Middlemarch, in particular, is often hailed as one of the greatest novels in the English language for its intricate portrayal of provincial life, nuanced characterization, and exploration of ambition, marriage, politics, and idealism. Evans lived for many years in a committed but unmarried partnership with the critic and philosopher George Henry Lewes, a relationship that contributed to her social ostracism but also to her intellectual and emotional stability. Her work profoundly influenced the development of the realist novel and continues to be studied and admired for its insight into human consciousness, ethics, and society.",
    "PenName": "George Eliot",
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 181,
    "Gender": 1,
    "BornAt": "1819-11-22T00:00:00",
    "DiedAt": "1880-12-22T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "7b9f4b2a-2e5b-4c9c-8f0b-3a7d2e8c4f91",
    "Name": "Edith Wharton",
    "ImagePath": "/images/authors/edith-wharton.jpg",
    "Biography": "Edith Wharton (January 24, 1862 – August 11, 1937) was an American novelist, short story writer, and essayist, renowned for her incisive portrayals of New York’s Gilded Age elite and the social constraints that shaped, and often stifled, individual desire. Born Edith Newbold Jones into a wealthy, old New York family, she grew up amid the rituals and expectations of high society—an environment she would later dissect with sharp psychological insight and ironic precision. Largely educated at home, she developed an early passion for reading and writing, publishing her first works in magazines and gradually turning to fiction. Her intimate knowledge of upper-class manners and her critical distance from them allowed her to expose the hypocrisies, rigid codes, and emotional costs of privilege, particularly for women whose lives were circumscribed by marriage, reputation, and money.\n\nWharton’s major novels include The House of Mirth, which chronicles the tragic fate of Lily Bart in a world where beauty and charm are never quite enough; Ethan Frome, a stark New England tragedy of thwarted love; and The Age of Innocence, a nuanced exploration of duty, passion, and renunciation set in 1870s New York, for which she became the first woman to win the Pulitzer Prize for Fiction. Beyond her fiction, she wrote travel literature, criticism, and memoirs, and was an accomplished designer and authority on architecture and interior decoration, co-authoring the influential book The Decoration of Houses. During World War I, she lived primarily in France, where she organized relief efforts for refugees and earned several honors for her humanitarian work. Wharton died at her home in Saint-Brice-sous-Forêt, near Paris, in 1937, leaving behind a body of work that continues to be celebrated for its stylistic elegance, moral complexity, and unsparing examination of the tensions between individual longing and social obligation.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 182,
    "Gender": 1,
    "BornAt": "1862-01-24T00:00:00",
    "DiedAt": "1937-08-11T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "e1d4c9b2-7a3f-4e21-9b8c-52f7b6a4d912",
    "Name": "Elizabeth Cleghorn Gaskell",
    "ImagePath": "/images/authors/elizabeth-gaskell.jpg",
    "Biography": "Elizabeth Cleghorn Gaskell (September 29, 1810 – November 12, 1865), often published as Mrs. Gaskell, was an English novelist, short story writer, and biographer known for her vivid portrayals of Victorian society and her compassionate depictions of class conflict, industrialization, and women’s lives. Born Elizabeth Stevenson in Chelsea, London, she was raised largely by relatives in Knutsford, Cheshire, after the early death of her mother. In 1832 she married William Gaskell, a Unitarian minister, and settled in Manchester, an industrial city whose harsh working conditions and social inequalities deeply influenced her fiction. Gaskell’s first major novel, Mary Barton (1848), offered an unflinching look at the struggles of the urban poor and brought her immediate attention. She went on to write Cranford, a gently satirical yet affectionate portrait of life in a small English town; North and South, which contrasts the industrial North of England with the more traditional South through the experiences of its heroine, Margaret Hale; and Wives and Daughters, an unfinished but widely admired novel of family life and social change. In addition to her novels, Gaskell wrote numerous short stories and novellas, including Gothic tales and social sketches, many of which were published in Charles Dickens’s periodical Household Words. Her The Life of Charlotte Brontë (1857) is a pioneering literary biography that helped shape Brontë’s posthumous reputation. Gaskell’s work combines detailed social observation with moral seriousness and emotional warmth, offering insight into the complexities of class, gender, and community in 19th-century Britain. She died suddenly in 1865 while visiting a newly purchased house in Hampshire, leaving Wives and Daughters incomplete. Today she is recognized as one of the most important Victorian novelists, valued for both her artistry and her social conscience.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 181,
    "Gender": 1,
    "BornAt": "1810-09-29T00:00:00",
    "DiedAt": "1865-11-12T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "2ab7f3c4-5d61-4d8c-9e72-1f3c0a8b9d55",
    "Name": "John Milton",
    "ImagePath": "/images/authors/john-milton.jpg",
    "Biography": "John Milton (December 9, 1608 – November 8, 1674) was an English poet, polemicist, and intellectual whose work profoundly shaped English literature and political thought. Born in London to a prosperous scrivener, Milton received a rigorous humanist education at St Paul’s School and Christ’s College, Cambridge, studying classical languages, philosophy, and theology. After university, he devoted himself to extensive private study, preparing for what he believed would be a great poetic vocation. During the English Civil War and the Interregnum, Milton became deeply involved in politics, writing influential prose tracts in defense of republicanism, freedom of the press, religious toleration, and civil liberties; he served as Latin Secretary to the Council of State under Oliver Cromwell. Despite going completely blind by his mid-forties, he continued to dictate his works, producing his masterpiece Paradise Lost, an epic poem that reimagines the biblical Fall of Man through the lens of cosmic rebellion, free will, and the nature of obedience and tyranny. He later wrote the companion epics Paradise Regained and the tragedy Samson Agonistes, further exploring themes of temptation, faith, suffering, and spiritual resilience. Milton’s richly allusive style, complex syntax, and powerful blank verse have challenged and inspired readers for centuries, while his political and religious writings have secured his reputation as one of the most formidable minds of the seventeenth century. Today he is regarded as one of the greatest poets in the English language, second only to Shakespeare in influence and stature.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 181,
    "Gender": 0,
    "BornAt": "1608-12-09T00:00:00",
    "DiedAt": "1674-11-08T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "8d2b1c64-1e8a-4f67-9c3b-1a274a53f812",
    "Name": "Alexander Pope",
    "ImagePath": "/images/authors/alexander-pope.jpg",
    "Biography": "Alexander Pope (May 21, 1688 – May 30, 1744) was an English poet, satirist, and translator, widely regarded as one of the foremost writers of the early 18th century and a central figure of the Augustan age in English literature. Born in London to a Catholic family at a time of significant religious and political tension, Pope was largely self-educated due to restrictions placed on Catholics in England. A childhood illness, likely tuberculosis of the spine, left him physically frail and stunted his growth, but he developed an extraordinary command of language and an early passion for classical literature. By his teens, he was already writing accomplished verse, and his early poems quickly brought him to the attention of the London literary world.\n\nPope is best known for his mastery of the heroic couplet and for works that combine wit, moral reflection, and sharp social commentary. His major poems include \"An Essay on Criticism,\" which offers both poetic theory and satirical portraits of bad critics; \"The Rape of the Lock,\" a mock-epic that transforms a trivial incident of high society into a brilliant, playful satire; and \"The Dunciad,\" a blistering attack on what he saw as the mediocrity and corruption of contemporary literary culture. In \"An Essay on Man,\" Pope explores philosophical questions about human nature, providence, and the apparent disorder of the world in polished, memorable verse. He also produced highly influential translations of Homer’s \"Iliad\" and \"Odyssey,\" which were both critical and commercial successes and helped secure his financial independence. Despite frequent attacks from critics and rivals—often answered with biting satire—Pope maintained a central position in English letters. His precise, aphoristic lines and his exploration of reason, taste, virtue, and folly have ensured his continuing presence in the canon of English poetry.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 181,
    "Gender": 0,
    "BornAt": "1688-05-21T00:00:00",
    "DiedAt": "1744-05-30T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "7d4f2a91-3b7c-4c28-9f13-2a8e6d5b9e77",
    "Name": "Thomas Stearns Eliot",
    "ImagePath": "/images/authors/thomas-stearns-eliot.jpg",
    "Biography": "Thomas Stearns Eliot (September 26, 1888 – January 4, 1965), known as T. S. Eliot, was a poet, playwright, critic, and editor who became one of the defining literary voices of the 20th century. Born in St. Louis, Missouri, into a prominent New England family, he was educated at Harvard University and later studied in Paris and at Merton College, Oxford. Eliot eventually settled in England, where he worked as a teacher, bank clerk, and, most significantly, as an editor at the publishing house Faber & Faber. His early masterpiece, The Love Song of J. Alfred Prufrock (1915), signaled a radical break with Victorian poetic traditions through its fragmented structure, interior monologue, and exploration of modern alienation. He went on to publish landmark works such as The Waste Land (1922), a dense, allusive poem that captured the spiritual and cultural dislocation of post–World War I Europe, and Four Quartets (1943), a meditative sequence on time, memory, and faith. Eliot also wrote influential verse dramas, including Murder in the Cathedral (1935) and The Cocktail Party (1949), seeking to revive poetic drama for contemporary audiences. His critical essays, such as “Tradition and the Individual Talent,” helped shape modern literary criticism, arguing for the importance of the literary canon and the impersonality of the poet. Awarded the Nobel Prize in Literature in 1948, Eliot became a central figure in Anglo-American modernism, and his work continues to influence poetry, drama, and criticism worldwide.",
    "PenName": "T. S. Eliot",
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 182,
    "Gender": 0,
    "BornAt": "1888-09-26T00:00:00",
    "DiedAt": "1965-01-04T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "3e9c2c52-7b6e-4d82-8af0-9d3bbbd5f4c2",
    "Name": "Albert Camus",
    "ImagePath": "/images/authors/albert-camus.jpg",
    "Biography": "Albert Camus (7 November 1913 – 4 January 1960) was a French-Algerian novelist, essayist, and philosopher often associated with existentialism, though he preferred to describe his work in terms of the \"absurd\"—the tension between humanity’s search for meaning and the indifferent universe. Born in Mondovi, French Algeria, to a poor pied-noir family, Camus lost his father in World War I and was raised by his mother in modest circumstances. A gifted student, he studied philosophy at the University of Algiers but had to abandon his formal studies due to tuberculosis, a chronic illness that shaped his sense of human fragility. Camus worked as a journalist and playwright, and during World War II he became involved in the French Resistance, editing the underground newspaper Combat and articulating a moral stance against both fascism and nihilism.\n\nCamus’s major works include the novel The Stranger, whose emotionally detached protagonist Meursault exemplifies the absurd condition; the philosophical essay The Myth of Sisyphus, which explores how one might live without ultimate meaning; The Plague, an allegorical novel about solidarity, suffering, and resistance; and The Rebel, a meditation on revolution, violence, and ethical limits. His clear, restrained prose and his insistence on human dignity in the face of injustice made him a central voice in postwar European thought. In 1957, he was awarded the Nobel Prize in Literature for his \"important literary production, which with clear-sighted earnestness illuminates the problems of the human conscience in our times.\" Camus died in a car accident near Villeblevin, France, at the age of 46, leaving an unfinished novel, The First Man, and a legacy as one of the 20th century’s most influential moral and literary figures.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 58,
    "Gender": 0,
    "BornAt": "1913-11-07T00:00:00",
    "DiedAt": "1960-01-04T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "c2f4a9d1-7b3e-4a6a-9c12-5e7b8d3f9a21",
    "Name": "Jean-Paul Charles Aymard Sartre",
    "ImagePath": "/images/authors/jean-paul-sartre.jpg",
    "Biography": "Jean-Paul Charles Aymard Sartre (June 21, 1905 – April 15, 1980) was a French philosopher, novelist, playwright, and literary critic, widely recognized as one of the central figures of 20th-century existentialism and phenomenology. Born in Paris, Sartre studied at the École Normale Supérieure, where he formed important intellectual friendships, including with fellow philosopher Simone de Beauvoir, his lifelong companion and collaborator. Drawing on the phenomenological tradition, Sartre developed a vision of human existence centered on radical freedom, personal responsibility, and the anguish that arises from the absence of any predetermined essence or divine plan. His major philosophical work, Being and Nothingness, explores consciousness, bad faith, and the complexities of human relationships, while his essays and lectures popularized existentialist ideas for a wider audience. Sartre also expressed his thought through literature: his novels Nausea and The Roads to Freedom trilogy, along with plays such as No Exit and Dirty Hands, dramatize individuals confronting absurdity, freedom, and moral ambiguity. Politically engaged throughout his life, Sartre was an outspoken critic of oppression and colonialism, aligning at various times with Marxist and leftist movements, though he refused to join any political party formally. In 1964 he was awarded the Nobel Prize in Literature but famously declined it, arguing that a writer should not become an institution. Until his death in 1980, Sartre remained an influential public intellectual, and his work continues to shape discussions in philosophy, literature, and political theory.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 58,
    "Gender": 0,
    "BornAt": "1905-06-21T00:00:00",
    "DiedAt": "1980-04-15T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "7c4b2f91-3e6d-4a8b-9f21-1d5a9b3c4e72",
    "Name": "Simone de Beauvoir",
    "ImagePath": "/images/authors/simone-de-beauvoir.jpg",
    "Biography": "Simone Lucie Ernestine Marie Bertrand de Beauvoir (January 9, 1908 – April 14, 1986) was a French writer, philosopher, feminist, and public intellectual whose work became foundational to modern feminist theory and existentialism. Born in Paris into a bourgeois Catholic family, she excelled academically, studying philosophy at the Sorbonne, where she formed a lifelong intellectual and personal partnership with Jean-Paul Sartre. Closely associated with the existentialist movement, de Beauvoir wrote novels, essays, memoirs, and political texts that explored freedom, responsibility, ambiguity, and the ways social structures shape individual lives. Her landmark work, The Second Sex (1949), is a sweeping analysis of women’s oppression and the construction of gender, famously asserting that one is not born but rather becomes a woman. The book helped ignite second-wave feminism and remains one of the most important feminist texts of the twentieth century. De Beauvoir also wrote acclaimed novels such as She Came to Stay and The Mandarins, as well as multi-volume memoirs including Memoirs of a Dutiful Daughter and The Prime of Life, in which she examined her own experiences, relationships, and political commitments. A committed activist, she supported anti-colonial struggles, human rights, and reproductive freedom, and used her public platform to challenge social and political injustices in France and beyond. Until her death in 1986, de Beauvoir continued to write and speak on ethics, aging, and the ongoing struggle for women’s liberation, leaving a legacy that continues to influence philosophy, literature, and feminist thought worldwide.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 58,
    "Gender": 1,
    "BornAt": "1908-01-09T00:00:00",
    "DiedAt": "1986-04-14T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "b93f8f6f-8da1-4f3b-a1b7-0f9e6d2c7a54",
    "Name": "Antoine de Saint-Exupéry",
    "ImagePath": "/images/authors/antoine-de-saint-exupery.jpg",
    "Biography": "Antoine de Saint-Exupéry (June 29, 1900 – July 31, 1944) was a French writer, pioneering aviator, and journalist, best known worldwide as the author of the beloved novella The Little Prince. Born in Lyon to an aristocratic but financially modest family, Saint-Exupéry developed an early fascination with flight and storytelling. He served in the French Air Force and later worked as a commercial pilot, flying mail routes across North Africa, the Sahara, and South America at a time when aviation was still dangerous and experimental. These experiences, filled with risk, isolation, and awe before the natural world, deeply shaped both his philosophical outlook and his literary imagination.\n\nSaint-Exupéry’s major works, including Night Flight, Wind, Sand and Stars, and Flight to Arras, blend adventure narrative with meditative reflections on duty, courage, friendship, and the search for meaning in a perilous modern world. His most famous book, The Little Prince (1943), written partly in exile during World War II, is a poetic fable about a pilot who meets a mysterious child from another planet in the desert. Combining simple, luminous language with his own whimsical watercolor illustrations, the story addresses themes of loneliness, love, loss, and the importance of seeing with the heart rather than the eyes. Though outwardly a children’s tale, it has become one of the most translated and widely read works in world literature.\n\nDuring World War II, Saint-Exupéry returned to flying, undertaking reconnaissance missions despite being over the usual age limit and in poor health. On July 31, 1944, he disappeared during a flight over the Mediterranean; his plane and remains were not conclusively identified until decades later, adding a legendary aura to his death. Saint-Exupéry is remembered not only as a skilled aviator but also as a humanist writer whose works celebrate responsibility, solidarity, and the fragile beauty of human bonds in a turbulent century.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 58,
    "Gender": 0,
    "BornAt": "1900-06-29T00:00:00",
    "DiedAt": "1944-07-31T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "d7c3b291-5f6e-4b4f-a2e9-9e4c1b7a2d55",
    "Name": "Rabindranath Tagore",
    "ImagePath": "/images/authors/rabindranath-tagore.jpg",
    "Biography": "Rabindranath Tagore (May 7, 1861 – August 7, 1941) was an Indian poet, novelist, playwright, composer, and philosopher, widely regarded as one of the most important literary figures of the modern era and a central voice of the Bengali Renaissance. Born in Calcutta (now Kolkata) into a prominent and culturally active family, Tagore received much of his education at home, immersing himself in literature, music, and philosophy. Writing primarily in Bengali, he transformed the language’s literary tradition with his lyrical poetry, innovative prose, and deeply humanistic vision. His collection of poems Gitanjali (Song Offerings) introduced many readers outside India to his work and earned him the Nobel Prize in Literature in 1913, making him the first non-European to receive the award. Tagore authored dozens of volumes of poetry, numerous novels such as Gora and Ghare-Baire (The Home and the World), short stories, plays, and essays, and he composed more than 2,000 songs, many of which remain central to Bengali cultural life. He also wrote the lyrics and music for “Jana Gana Mana,” later adopted as the national anthem of India, and his work inspired the national anthem of Bangladesh, “Amar Shonar Bangla.” A committed educational reformer and internationalist, Tagore founded Visva-Bharati University at Santiniketan as an experiment in holistic, cross-cultural learning. Throughout his life he engaged with global intellectual currents, traveling widely and corresponding with leading thinkers of his time while critiquing both Western imperialism and narrow nationalism. Tagore’s fusion of spiritual insight, social critique, and artistic innovation has left an enduring legacy in world literature, music, and education.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 74,
    "Gender": 0,
    "BornAt": "1861-05-07T00:00:00",
    "DiedAt": "1941-08-07T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "c2b8c9c4-9e2a-4f1a-a5d9-3e7c2d0f9b12",
    "Name": "Khalil Gibran",
    "ImagePath": "/images/authors/khalil-gibran.jpg",
    "Biography": "Khalil Gibran (January 6, 1883 – April 10, 1931) was a Lebanese-American writer, poet, philosopher, and artist best known for his book The Prophet, a collection of poetic essays that has become one of the most widely read and translated works of the 20th century. Born in the town of Bsharri in what was then Ottoman-ruled Mount Lebanon, Gibran emigrated with his mother and siblings to the United States in 1895, settling in Boston’s South End, which had a large Syrian and Lebanese community. As a young man he returned to Beirut to study Arabic literature before moving back to the West, eventually dividing his life between the United States and France. This bicultural experience deeply shaped his writing, which weaves together elements of Eastern mysticism, Christian and Islamic traditions, and Western romanticism and symbolism.\n\nGibran wrote in both Arabic and English, producing collections of poetry, short stories, and essays that explore themes of love, freedom, spirituality, identity, and the human condition. The Prophet (1923), his most famous work, presents a series of lyrical discourses on topics such as joy and sorrow, marriage, work, children, and death, framed as the farewell teachings of a wise man departing a city. Though only modestly received at first, the book gradually became a global phenomenon, cherished for its aphoristic wisdom and accessible spiritual depth. Other notable works include The Madman, The Forerunner, and Jesus the Son of Man, as well as Arabic collections that secured his place in modern Arabic literature. In addition to his writing, Gibran was an accomplished visual artist who produced hundreds of drawings and paintings. He died in New York City in 1931, but his words continue to resonate across cultures and generations, often quoted in contexts ranging from weddings and funerals to political speeches and personal reflections on love and meaning.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 93,
    "Gender": 0,
    "BornAt": "1883-01-06T00:00:00",
    "DiedAt": "1931-04-10T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "7c2f5b81-4e2f-4f9c-8a1e-2b7a9c5d3e44",
    "Name": "Khaled Hosseini",
    "ImagePath": "/images/authors/khaled-hosseini.jpg",
    "Biography": "Khaled Hosseini (born March 4, 1965) is an Afghan-American novelist, physician, and humanitarian best known for his emotionally powerful novels exploring themes of family, exile, guilt, and redemption against the backdrop of Afghanistan’s turbulent recent history. Born in Kabul to a diplomat father and a mother who taught Persian literature, Hosseini spent part of his childhood in Tehran and later moved with his family to Paris due to his father’s diplomatic posting. In 1980, following the Soviet invasion of Afghanistan, the family sought political asylum in the United States and settled in California. Hosseini studied biology at Santa Clara University and went on to earn a medical degree from the University of California, San Diego, practicing as an internist for several years. His debut novel, The Kite Runner (2003), became an international bestseller, telling the haunting story of friendship and betrayal between two boys in Kabul and the long shadow of Afghanistan’s political upheaval. He followed this success with A Thousand Splendid Suns (2007), a deeply affecting portrait of two Afghan women whose lives intersect across decades of war and oppression, and And the Mountains Echoed (2013), a multigenerational saga examining the bonds of family and the ripples of a single fateful decision. Hosseini has also written the illustrated novella Sea Prayer, inspired by the refugee crisis. Beyond his literary work, he serves as a Goodwill Ambassador for the UNHCR and founded the Khaled Hosseini Foundation, which supports humanitarian projects in Afghanistan, particularly for refugees, women, and children. His blend of intimate storytelling and historical awareness has introduced millions of readers around the world to the human stories behind Afghanistan’s conflicts.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 1,
    "Gender": 0,
    "BornAt": "1965-03-04T00:00:00",
    "DiedAt": null,
    "IsApproved": true
  },
  {
    "Id": "4f9c1b72-3d6a-4e2e-9c81-7a5b2c4d9f10",
    "Name": "Kazuo Ishiguro",
    "ImagePath": "/images/authors/kazuo-ishiguro.jpg",
    "Biography": "Kazuo Ishiguro (born November 8, 1954) is a British novelist and screenwriter, widely acclaimed for his subtle, emotionally resonant explorations of memory, identity, and the passage of time. Born in Nagasaki, Japan, he moved to England with his family at the age of five and later studied English and philosophy at the University of Kent before completing a master’s degree in creative writing at the University of East Anglia. Ishiguro’s early novels, including A Pale View of Hills and An Artist of the Floating World, reflect his Japanese background and focus on characters grappling with guilt, loss, and the unreliability of recollection. He achieved international recognition with The Remains of the Day, a Booker Prize–winning novel that follows an English butler’s reflections on loyalty, dignity, and missed opportunities in the aftermath of World War II. His later works, such as Never Let Me Go, The Buried Giant, and Klara and the Sun, blend realism with speculative and fantastical elements, using restrained, understated prose to probe ethical and emotional questions beneath seemingly quiet surfaces. In 2017, Ishiguro was awarded the Nobel Prize in Literature for novels that, in the words of the Swedish Academy, reveal “the abyss beneath our illusory sense of connection with the world.” Known for his careful craftsmanship and genre-defying approach, he remains one of the most influential contemporary authors, with his books frequently adapted for film and television and translated into numerous languages.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 181,
    "Gender": 0,
    "BornAt": "1954-11-08T00:00:00",
    "DiedAt": null,
    "IsApproved": true
  },
  {
    "Id": "f4b2c8d1-9e37-4b6c-a1f2-6c8b7d3e5910",
    "Name": "Salman Rushdie",
    "ImagePath": "/images/authors/salman-rushdie.jpg",
    "Biography": "Salman Rushdie (born June 19, 1947) is an Indian-born British-American novelist and essayist, renowned for his inventive blend of magic realism, historical narrative, and sharp political and cultural satire. Born in Bombay (now Mumbai), he was educated in England at Rugby School and at King’s College, Cambridge, where he studied history. After working in advertising in London, he turned full-time to writing, emerging as a central figure in postcolonial literature and contemporary world fiction. His breakthrough novel, Midnight’s Children (1981), which follows a child born at the exact moment of India’s independence, won the Booker Prize and has frequently been hailed as one of the greatest novels in English of the late 20th century. The book’s daring narrative structure, exuberant language, and exploration of national identity and personal memory established many of the themes that would define his career.\n\nRushdie’s later works continued to push boundaries both stylistically and politically. The Satanic Verses (1988), a complex, multilayered novel engaging with migration, faith, and the imagination, provoked intense controversy in parts of the Muslim world and led to a death sentence (fatwa) issued against him by Iran’s Ayatollah Khomeini in 1989. Forced into years of police protection and semi-clandestine life, Rushdie nevertheless kept writing, producing novels such as The Moor’s Last Sigh, The Ground Beneath Her Feet, Shalimar the Clown, and The Enchantress of Florence, as well as essays and criticism that reflect on censorship, religious extremism, freedom of expression, and the role of the writer in a globalized world. His memoir Joseph Anton (2012) recounts his years under the fatwa, while later works, including Quichotte and subsequent fiction and non-fiction, demonstrate his continuing engagement with migration, media culture, and the tensions between myth and reality. Knighted in 2007 for services to literature and honored with numerous international awards, Rushdie remains one of the most influential and debated literary voices of his generation.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 74,
    "Gender": 0,
    "BornAt": "1947-06-19T00:00:00",
    "DiedAt": null,
    "IsApproved": true
  },
  {
    "Id": "9f0c7b32-2f84-4cde-867e-3b0d4a6f9123",
    "Name": "Orhan Pamuk",
    "ImagePath": "/images/authors/orhan-pamuk.jpg",
    "Biography": "Orhan Pamuk (born June 7, 1952) is a Turkish novelist, essayist, and academic, widely regarded as one of the most significant contemporary writers and the leading voice of postmodern Turkish literature. Raised in an upper-middle-class family in Istanbul, he initially studied architecture before turning to writing full-time, drawing deeply on the city’s layered history, cultural tensions, and shifting identities. Pamuk’s novels often weave together elements of mystery, philosophical reflection, and metafiction, exploring themes such as East–West encounter, tradition versus modernity, memory, and the instability of personal and national identity. His major works include The White Castle, The Black Book, My Name Is Red, Snow, The Museum of Innocence, and Istanbul: Memories and the City, many of which have been translated into dozens of languages and have reached a wide international readership. In 2006, Pamuk was awarded the Nobel Prize in Literature for a body of work that, in the words of the Swedish Academy, \"in the quest for the melancholic soul of his native city has discovered new symbols for the clash and interlacing of cultures.\" Known both for his intricate narratives and his willingness to address politically sensitive subjects, he has at times been a controversial figure in Turkey, engaging publicly with questions of history, censorship, and freedom of expression. Alongside his fiction, Pamuk has written essays, lectures, and non-fiction works that further develop his meditations on art, literature, and the meaning of home, establishing him as a central figure in world literature.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 175,
    "Gender": 0,
    "BornAt": "1952-06-07T00:00:00",
    "DiedAt": null,
    "IsApproved": true
  },
  {
    "Id": "fd8a8c39-5e6f-4c77-9d1a-2b3f7b70c812",
    "Name": "Umberto Eco",
    "ImagePath": "/images/authors/umberto-eco.jpg",
    "Biography": "Umberto Eco (5 January 1932 – 19 February 2016) was an Italian novelist, essayist, philosopher, semiotician, and medievalist whose work bridged the worlds of academic scholarship and popular fiction. Born in Alessandria, in Italy’s Piedmont region, Eco studied medieval philosophy and literature at the University of Turin and became one of the leading theorists of semiotics, the study of signs and meaning. Over the course of his academic career, he taught at universities across Europe and the United States, wrote influential works such as \"A Theory of Semiotics\" and \"The Open Work,\" and engaged deeply with questions of interpretation, mass media, and the role of the reader in creating meaning. His erudition, wit, and ability to draw connections between high culture and popular culture made him a distinctive public intellectual in late 20th-century Europe.\n\nEco achieved worldwide fame with his first novel, \"The Name of the Rose\" (1980), a historical murder mystery set in a medieval monastery that combines detective fiction, theological debate, and reflections on knowledge, heresy, and power. The book became an international bestseller and was later adapted into a film and television series. He followed it with novels such as \"Foucault’s Pendulum,\" \"The Island of the Day Before,\" \"Baudolino,\" \"The Prague Cemetery,\" and \"Numero Zero,\" each dense with intertextual references, historical puzzles, and playful narrative structures. Alongside his fiction, Eco wrote essays and newspaper columns on topics ranging from literature and philosophy to politics, technology, and everyday life, many collected in volumes like \"Travels in Hyperreality\" and \"How to Travel with a Salmon.\" Known for his wry humor and formidable learning, Eco left a legacy as both a rigorous scholar and a storyteller who demonstrated that complex ideas could be explored through compelling, accessible narrative.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 80,
    "Gender": 0,
    "BornAt": "1932-01-05T00:00:00",
    "DiedAt": "2016-02-19T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "f2a4c5d6-1234-4b89-9e8f-0a1b2c3d4e5f",
    "Name": "Milan Kundera",
    "ImagePath": "/images/authors/milan-kundera.jpg",
    "Biography": "Milan Kundera (April 1, 1929 – July 11, 2023) was a Czech-born French novelist, essayist, and playwright, celebrated for his intellectually playful yet deeply philosophical fiction that explores memory, identity, history, and the absurdity of existence. Born in Brno, Czechoslovakia, Kundera studied music and literature and initially aligned himself with the Communist Party, from which he was later expelled amid political tensions. His early career included poetry and teaching, but he gained international recognition with his novels, which blend narrative, essayistic reflection, and ironic commentary. His best-known work, The Unbearable Lightness of Being, set against the backdrop of the 1968 Prague Spring and its aftermath, examines love, politics, and personal freedom through a mix of intimate relationships and historical events. Other notable works include The Joke, Life Is Elsewhere, The Book of Laughter and Forgetting, and Immortality, many of which were banned in his homeland for their critical stance toward totalitarianism and ideological dogmatism. After the Soviet-led invasion of Czechoslovakia, Kundera’s books were removed from libraries and he faced increasing official harassment; in 1975 he emigrated to France, where he eventually became a French citizen and began writing primarily in French rather than Czech. His style, marked by digressions, metafictional techniques, and a questioning of narrative certainty, made him one of the most distinctive voices in postwar European literature. Often wary of publicity and protective of his privacy, Kundera granted few interviews and resisted biographical interpretation of his work, insisting that a writer’s true identity resides in their books. He died in Paris in 2023, leaving a body of work that continues to provoke reflection on the entanglement of private lives and history.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 43,
    "Gender": 0,
    "BornAt": "1929-04-01T00:00:00",
    "DiedAt": "2023-07-11T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "1c7e9d4a-2f30-4c80-9e4d-7b3c2d5f9a61",
    "Name": "Jorge Francisco Isidoro Luis Borges",
    "ImagePath": "/images/authors/jorge-luis-borges.jpg",
    "Biography": "Jorge Francisco Isidoro Luis Borges (August 24, 1899 – June 14, 1986) was an Argentine writer, librarian, and literary critic whose essays, short stories, and poems fundamentally reshaped 20th-century literature. Born in Buenos Aires to a bookish, multilingual family, he grew up surrounded by English and Spanish literature and developed an early fascination with language, philosophy, and the infinite possibilities of narrative. After spending part of his youth in Europe during World War I, Borges returned to Argentina and became a central figure in the country’s literary avant-garde, publishing experimental poetry and essays before turning decisively to the short story form. His most famous collections, including Ficciones and El Aleph, present labyrinthine narratives filled with mirrors, libraries, encyclopedias, dreams, and paradoxes, exploring themes such as time, identity, fate, and the unstable nature of reality. Often blending fiction, criticism, and philosophical speculation, Borges created metafictional worlds in which authors, readers, and characters overlap, influencing movements such as magical realism and postmodernism. He also worked as a librarian and was eventually appointed director of the National Library of Argentina, even as a hereditary condition led to his progressive blindness, which he transformed into a source of imaginative power rather than limitation. In addition to his fiction, Borges wrote influential essays on literature, translation, and metaphysics, and produced celebrated translations himself. Although he never received the Nobel Prize in Literature, he is widely regarded as one of the most important and original writers of the modern era, his work continuing to inspire authors, philosophers, and readers around the world.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 7,
    "Gender": 0,
    "BornAt": "1899-08-24T00:00:00",
    "DiedAt": "1986-06-14T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "e7c5d9b1-8f23-4ad6-bd7b-0af613d49c2a",
    "Name": "Italo Calvino",
    "ImagePath": "/images/authors/italo-calvino.jpg",
    "Biography": "Italo Calvino (October 15, 1923 – September 19, 1985) was an Italian writer, essayist, and editor, celebrated for his inventive narrative experiments and his blend of fantasy, philosophy, and precise, crystalline prose. Born in Santiago de Las Vegas, near Havana, Cuba, to Italian parents who were both scientists, he was raised from early childhood in Liguria, Italy. During World War II, Calvino joined the Italian Resistance against fascism, an experience that informed his early neorealist works. After the war, he became associated with the Einaudi publishing house in Turin, where he worked as an editor and became part of a vibrant literary and intellectual circle. His debut novel, \"The Path to the Nest of Spiders\" (1947), offered a distinctive take on partisan warfare through the eyes of a child, and helped establish him as an important new voice in postwar Italian literature.\n\nOver the following decades, Calvino’s writing evolved from neorealism to increasingly imaginative and metafictional forms. He gained wide recognition with works such as the \"Our Ancestors\" trilogy (\"The Cloven Viscount,\" \"The Baron in the Trees,\" and \"The Nonexistent Knight\"), which uses allegorical, fairy-tale-like narratives to explore identity, autonomy, and the fragmentation of the modern self. Collections like \"Cosmicomics\" and \"t zero\" fuse science, myth, and playful storytelling, turning abstract scientific concepts into whimsical tales with philosophical undercurrents. His later masterpieces, including \"Invisible Cities\" and \"If on a winter’s night a traveler,\" push narrative experimentation even further, questioning the nature of storytelling, perception, and reality itself. In the 1960s and 1970s, Calvino spent significant time in France, interacting with members of the Oulipo group, whose interest in literary constraints and structures resonated with his own formal curiosity.\n\nIn addition to his fiction, Calvino wrote essays and lectures on literature, language, and imagination, many of which were collected posthumously in volumes such as \"Six Memos for the Next Millennium,\" based on a series of Charles Eliot Norton Lectures he was preparing at the time of his death. He died suddenly in 1985, but his work continues to be read worldwide for its lightness, intelligence, and inventive reimagining of what narrative can do. Calvino remains a central figure in world literature, admired for his ability to combine playfulness and rigor, fantasy and thought, in ways that speak both to his own time and to readers of later generations.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 80,
    "Gender": 0,
    "BornAt": "1923-10-15T00:00:00",
    "DiedAt": "1985-09-19T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "e2b0cf7a-0b9b-4c7b-9e5d-8ac3f4d92134",
    "Name": "José Saramago",
    "ImagePath": "/images/authors/jose-saramago.jpg",
    "Biography": "José Saramago (November 16, 1922 – June 18, 2010) was a Portuguese novelist, essayist, and journalist, celebrated as one of the most distinctive voices in contemporary world literature. Born in the rural village of Azinhaga in central Portugal and raised in a working-class family, Saramago worked variously as a mechanic, civil servant, editor, and translator before gaining widespread recognition as a writer later in life. His fiction, often blending political allegory, philosophical inquiry, and elements of magical realism, is known for its long, sinuous sentences, unconventional punctuation, and an ironic, omniscient narrative voice that moves fluidly between characters’ inner thoughts and broader social commentary. Major works include Baltasar and Blimunda, The Year of the Death of Ricardo Reis, The Gospel According to Jesus Christ, Blindness, and All the Names, many of which probe themes such as authoritarianism, religious dogma, human vulnerability, and the resilience of solidarity and compassion. A committed leftist and outspoken critic of political and religious power, Saramago was at times a controversial figure in Portugal and abroad, particularly after the publication of The Gospel According to Jesus Christ, which drew criticism from the Catholic Church and contributed to his decision to settle on the Spanish island of Lanzarote. In 1998, he was awarded the Nobel Prize in Literature for a body of work that, in the words of the Swedish Academy, makes it possible \"to again apprehend an elusory reality\". Until his death in 2010, Saramago remained an active public intellectual, maintaining a widely read blog and continuing to write novels and essays that challenged readers to question accepted truths and confront social injustice.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 137,
    "Gender": 0,
    "BornAt": "1922-11-16T00:00:00",
    "DiedAt": "2010-06-18T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "91a9f4d4-58f9-424f-bf0c-6cecd6b52c33",
    "Name": "Aleksandr Solzhenitsyn",
    "ImagePath": "/images/authors/aleksandr-solzhenitsyn.jpg",
    "Biography": "Aleksandr Isayevich Solzhenitsyn (11 December 1918 – 3 August 2008) was a Russian novelist, historian, and dissident whose writings exposed the brutal realities of the Soviet prison camp system and played a major role in shaping global perceptions of Soviet communism. Born in Kislovodsk in southern Russia shortly after the Bolshevik Revolution, he grew up in modest circumstances and studied mathematics and physics, while secretly nurturing literary ambitions. During World War II he served as an officer in the Red Army, but in 1945 he was arrested for criticizing Joseph Stalin in private correspondence and sentenced to eight years in labor camps, followed by internal exile in Kazakhstan. These experiences in the Gulag left a profound mark on him, providing the material and moral impetus for much of his later work and instilling in him a lifelong conviction that truth-telling and moral courage were the only viable responses to totalitarianism.\n\nSolzhenitsyn first came to international prominence with \"One Day in the Life of Ivan Denisovich\" (1962), a stark, groundbreaking novella about a prisoner’s struggle to survive a single day in a Soviet labor camp, published in the brief cultural thaw under Nikita Khrushchev. Later works such as \"The First Circle,\" \"Cancer Ward,\" and especially the monumental \"The Gulag Archipelago\"—a vast, documentary-style narrative based on his own experiences and countless testimonies—offered an unprecedented, searing indictment of the Soviet system of repression. Harassed and censored by the authorities, he was stripped of his citizenship and expelled from the Soviet Union in 1974, eventually settling in Vermont, where he continued to write and to critique both Soviet communism and what he saw as the spiritual emptiness and materialism of the West. Awarded the Nobel Prize in Literature in 1970, Solzhenitsyn returned to Russia in 1994 after the collapse of the Soviet Union, remaining an influential and sometimes controversial moral voice until his death in 2008. His work endures as a powerful testament to the resilience of the human spirit and the ethical imperative to confront lies with truth.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 140,
    "Gender": 0,
    "BornAt": "1918-12-11T00:00:00",
    "DiedAt": "2008-08-03T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "0f6a9c3d-7c2b-4c5e-8f91-5a2d7b1e9c44",
    "Name": "Nikolai Vasilyevich Gogol",
    "ImagePath": "/images/authors/nikolai-gogol.jpg",
    "Biography": "Nikolai Vasilyevich Gogol (March 31, 1809 – March 4, 1852) was a Ukrainian-born Russian novelist, short story writer, and dramatist, regarded as one of the most innovative and influential figures in 19th-century Russian literature. Born in the Poltava region of the Russian Empire (present-day Ukraine), Gogol grew up in a minor landowning family and was exposed early to Ukrainian folklore, landscapes, and oral traditions, elements that later infused his imaginative and often grotesque tales. After moving to St. Petersburg, he struggled to find his footing, briefly working in government posts before turning to literature. His early collections Evenings on a Farm Near Dikanka and Mirgorod drew on Ukrainian settings and legends, blending the comic, the supernatural, and the macabre. Gogol’s Petersburg stories—such as \"Nevsky Prospect,\" \"The Nose,\" and \"The Overcoat\"—offered darkly humorous, surreal, and poignant portraits of petty bureaucrats and urban alienation, exerting a profound influence on later Russian writers. His satirical play The Government Inspector exposed the absurdity and corruption of provincial officialdom and became a landmark of Russian theatre. Gogol’s most ambitious work, the novel Dead Souls, was conceived as the first part of a grand moral and spiritual epic about Russia; the published first volume combines biting social satire with a haunting, ambiguous vision of a society mired in serfdom, greed, and moral emptiness. Troubled by religious scruples and perfectionism, Gogol later burned much of the manuscript for the planned continuation of Dead Souls. His final years were marked by ill health, spiritual crisis, and self-doubt, and he died in Moscow in 1852. Despite his relatively small body of work, Gogol’s blend of realism, fantasy, satire, and psychological depth helped shape the course of Russian and world literature, inspiring writers from Dostoevsky and Kafka to modern absurdists.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 140,
    "Gender": 0,
    "BornAt": "1809-03-31T00:00:00",
    "DiedAt": "1852-03-04T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "5f21c8a3-9b74-4e0a-b2f6-21d9a6c4e8b2",
    "Name": "Karl Stig-Erland Larsson",
    "ImagePath": "/images/authors/stieg-larsson.jpg",
    "Biography": "Karl Stig-Erland Larsson (August 15, 1954 – November 9, 2004), known professionally as Stieg Larsson, was a Swedish journalist, editor, and novelist best known for the internationally bestselling Millennium trilogy. Born in Skellefteå, Sweden, and raised for much of his childhood by his grandparents in the rural village of Västerbotten, Larsson developed an early interest in writing, politics, and social justice. He spent much of his career as an investigative journalist specializing in right-wing extremism, racism, and neo-Nazi movements, working for news agencies and eventually co-founding the anti-fascist magazine Expo. His journalism was marked by a deep commitment to democracy and human rights, and his research made him a target of threats and harassment from extremist groups. In his spare time, Larsson secretly wrote crime fiction, channeling his knowledge of politics, corporate corruption, and misogyny into the Millennium series. The trilogy—The Girl with the Dragon Tattoo, The Girl Who Played with Fire, and The Girl Who Kicked the Hornets’ Nest—follows investigative journalist Mikael Blomkvist and brilliant hacker Lisbeth Salander as they uncover abuse of power, violence against women, and systemic injustice in contemporary Sweden. Blending complex plotting with sharp social critique, the novels offered a darker, more politically engaged take on Nordic crime fiction and helped popularize the genre worldwide. Larsson died suddenly of a heart attack in 2004, before seeing his novels published or witnessing their enormous success, which has included translations into dozens of languages and numerous film and television adaptations. His work continues to influence crime writing globally and to draw attention to issues of corruption, extremism, and gender-based violence.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 164,
    "Gender": 0,
    "BornAt": "1954-08-15T00:00:00",
    "DiedAt": "2004-11-09T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "ad2f3b16-9c41-4d2a-8f89-0b8f9a5e7c3d",
    "Name": "Dashiell Hammett",
    "ImagePath": "/images/authors/dashiell-hammett.jpg",
    "Biography": "Dashiell Hammett (May 27, 1894 – January 10, 1961) was an American writer of crime fiction and one of the key architects of the hardboiled detective genre. Born Samuel Dashiell Hammett in St. Mary’s County, Maryland, he grew up in Baltimore and Philadelphia before leaving school early to work a series of jobs, most notably as a private detective for the Pinkerton National Detective Agency. This experience gave him an intimate familiarity with the realities of crime, violence, and corruption, which he later transformed into lean, unsentimental fiction. Hammett served in the U.S. Army during World War I but contracted tuberculosis, a condition that would trouble him for the rest of his life and eventually help push him toward a full-time writing career.\n\nHammett first gained attention in the 1920s with short stories published in pulp magazines such as Black Mask, where he introduced his nameless Continental Op detective. His early novels—\"Red Harvest\" (1929) and \"The Dain Curse\" (1929)—featured the Op and helped redefine crime fiction by stripping away the genteel puzzle elements of earlier detective stories and replacing them with gritty realism, moral ambiguity, and sharp, colloquial dialogue. He achieved lasting fame with \"The Maltese Falcon\" (1930), which introduced the iconic private eye Sam Spade; \"The Glass Key\" (1931), a story of political corruption and divided loyalties; and \"The Thin Man\" (1934), a more urbane, witty blend of mystery and social comedy featuring Nick and Nora Charles. Hammett’s spare, precise prose and tough-minded worldview exerted a profound influence on subsequent crime writers, filmmakers, and the broader popular imagination.\n\nIn later years, Hammett became increasingly involved in left-wing politics and anti-fascist activism. His association with the Communist Party and refusal to cooperate with the House Un-American Activities Committee during the early Cold War led to his blacklisting, imprisonment for contempt of court, and surveillance by U.S. authorities. These pressures, combined with longstanding health problems and heavy drinking, contributed to his withdrawal from active writing; after the mid-1930s he produced relatively little new fiction. He spent much of his later life in New York and on a farm in rural Maryland, and was a long-time companion of playwright Lillian Hellman. Although his published output is comparatively small, Hammett’s work fundamentally transformed the detective story, bringing a new level of psychological complexity and social realism to the genre and paving the way for writers such as Raymond Chandler and countless successors.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 182,
    "Gender": 0,
    "BornAt": "1894-05-27T00:00:00",
    "DiedAt": "1961-01-10T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "5f9b8c11-2d3a-4f7b-9a4e-7c2e3b8d9142",
    "Name": "Raymond Thornton Chandler",
    "ImagePath": "/images/authors/raymond-chandler.jpg",
    "Biography": "Raymond Thornton Chandler (July 23, 1888 – March 26, 1959) was an American-British novelist and screenwriter, best known as one of the defining voices of hardboiled detective fiction. Born in Chicago and raised partly in England, where he received a classical education at Dulwich College, Chandler returned to the United States as a young man and worked in various jobs, eventually becoming a successful oil executive in California. The Great Depression led to his dismissal from the oil industry, and in his forties he turned to writing, initially publishing short stories in pulp magazines such as Black Mask. Chandler’s first novel, The Big Sleep (1939), introduced private detective Philip Marlowe, a tough, morally complex, and deeply introspective figure who would become one of crime fiction’s most iconic characters. Subsequent novels, including Farewell, My Lovely (1940), The Lady in the Lake (1943), The Long Goodbye (1953), and Playback (1958), combined intricate plots with richly atmospheric depictions of Los Angeles, exposing the corruption, greed, and disillusionment beneath the city’s glamorous surface. Chandler’s prose is celebrated for its sharp dialogue, vivid similes, and lyrical yet unsentimental style, which elevated detective fiction to a new level of literary artistry. In addition to his novels and stories, he worked as a Hollywood screenwriter, contributing to films such as Double Indemnity and The Blue Dahlia. Despite personal struggles with alcoholism and loneliness, Chandler left a lasting legacy: his work reshaped the modern crime novel and influenced generations of writers and filmmakers, ensuring his reputation as a master of noir literature.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 182,
    "Gender": 0,
    "BornAt": "1888-07-23T00:00:00",
    "DiedAt": "1959-03-26T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "f43e3f9f-8c7e-4a6e-9c5f-3c7e2b1d9a10",
    "Name": "Ian Lancaster Fleming",
    "ImagePath": "/images/authors/ian-fleming.jpg",
    "Biography": "Ian Lancaster Fleming (28 May 1908 – 12 August 1964) was a British author, journalist, and naval intelligence officer best known as the creator of James Bond, the suave, hard-edged secret agent who became one of the most iconic figures in popular fiction and film. Born in London into a well-connected family, Fleming was educated at Eton and Sandhurst and later worked in journalism and finance before finding his way into intelligence work. During World War II he served as a key aide in the British Naval Intelligence Division, where he helped plan covert operations and gained firsthand experience of espionage, codebreaking, and wartime strategy—material that would later inform the intricate plots, gadgets, and geopolitical tensions of his thrillers.\n\nFleming began writing the Bond novels while working as a foreign manager for the Sunday Times, publishing \"Casino Royale\" in 1953. Over the next decade he produced a series of novels and short story collections, including \"Live and Let Die,\" \"Moonraker,\" \"From Russia, with Love,\" \"Dr. No,\" \"Goldfinger,\" and \"On Her Majesty’s Secret Service.\" These books introduced readers to a glamorous yet dangerous world of high-stakes gambling, exotic locales, Cold War intrigue, and larger-than-life villains, all filtered through Bond’s cool professionalism and complicated morality. Fleming’s lean, vivid prose and meticulous attention to detail helped redefine the modern spy thriller. In addition to the Bond series, he wrote the children’s classic \"Chitty-Chitty-Bang-Bang\" and several works of nonfiction. Although he did not live to see the full extent of the cinematic phenomenon his creation would inspire, the James Bond films—beginning with \"Dr. No\" in 1962—ensured his enduring influence on global popular culture. Fleming died in Kent in 1964, but his blend of espionage, style, and suspense continues to shape the spy genre and captivate audiences worldwide.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 181,
    "Gender": 0,
    "BornAt": "1908-05-28T00:00:00",
    "DiedAt": "1964-08-12T00:00:00",
    "IsApproved": true
  },
  {
    "Id": "b13a2d6f-4f7a-4d2b-a0de-9b3c4f7e81a2",
    "Name": "James Patterson",
    "ImagePath": "/images/authors/james-patterson.jpg",
    "Biography": "James Patterson (born March 22, 1947) is an American author and one of the most commercially successful and widely read writers of contemporary popular fiction. Raised in Newburgh, New York, he worked in advertising—eventually becoming an executive at a major agency—before turning to writing full-time after the success of his early novels. Patterson is best known for fast-paced, plot-driven thrillers, particularly those featuring recurring characters such as forensic psychologist Alex Cross, protagonist of Along Came a Spider and many subsequent bestsellers, and the Women’s Murder Club series, which follows a group of professional women solving complex criminal cases in San Francisco. Beyond crime and suspense fiction, he has written (often in collaboration with co-authors) in a wide range of genres, including young adult fiction, romance, nonfiction, and middle-grade adventures like the Maximum Ride and Middle School series. Known for his short chapters, brisk pacing, and cinematic style, Patterson’s books have sold hundreds of millions of copies worldwide and frequently top bestseller lists, with many adapted for film and television. He has also become a prominent supporter of literacy and libraries, donating to schools, independent bookstores, and reading programs, and advocating for children’s access to books. Despite critical debate over his use of co-writers and his prolific output, Patterson remains a defining figure in modern popular fiction, credited with bringing countless readers—especially reluctant ones—into the habit of reading.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 182,
    "Gender": 0,
    "BornAt": "1947-03-22T00:00:00",
    "DiedAt": null,
    "IsApproved": true
  },
  {
    "Id": "24b7b9a1-2f63-49f0-8f1e-7c2d4a9e5b31",
    "Name": "John Grisham",
    "ImagePath": "/images/authors/john-grisham.jpg",
    "Biography": "John Grisham (born February 8, 1955) is an American novelist, lawyer, and former politician, best known for popularizing the modern legal thriller. Born in Jonesboro, Arkansas, and raised in a working-class family that moved frequently across the South, Grisham initially aspired to be a professional baseball player before turning to law and public service. He earned his law degree from the University of Mississippi and spent nearly a decade practicing as a small-town attorney in Southaven, Mississippi, specializing in criminal and civil litigation. During this time he also served as a Democratic member of the Mississippi House of Representatives from 1984 to 1990. The long hours in courtrooms and his firsthand exposure to the complexities and inequities of the legal system provided rich material for his fiction.\n\nGrisham’s debut novel, \"A Time to Kill\" (1989), inspired by a courtroom case he observed, initially received modest attention but later became a bestseller and a major film. His breakthrough came with \"The Firm\" (1991), a tense story about a young lawyer drawn into a corrupt law firm; its runaway success and subsequent film adaptation established Grisham as a major commercial writer. He followed with a string of bestsellers—\"The Pelican Brief,\" \"The Client,\" \"The Chamber,\" \"The Rainmaker,\" \"The Runaway Jury,\" and many others—that cemented his reputation as the foremost author of legal thrillers. His novels are known for their fast-paced plots, accessible prose, and focus on ordinary individuals confronting powerful institutions, often exposing corruption, injustice, and moral compromise in the legal and corporate worlds.\n\nBeyond his courtroom dramas, Grisham has written works that expand his range, including the baseball-themed novel \"Calico Joe,\" the Christmas comedy \"Skipping Christmas,\" and a series of legal mysteries for younger readers featuring Theodore Boone. Many of his books have been adapted into successful films and television series, further increasing his global reach. A strong advocate for literacy and criminal justice reform, Grisham supports libraries, writing programs, and organizations that work to exonerate the wrongfully convicted, drawing on his legal background to highlight systemic flaws. Living primarily in Virginia and Mississippi, he continues to write regularly, remaining one of the most widely read and recognizable authors in contemporary popular fiction.",
    "PenName": null,
    "RatingsCount": 0,
    "AverageRating": 0.0,
    "Nationality": 182,
    "Gender": 0,
    "BornAt": "1955-02-08T00:00:00",
    "DiedAt": null,
    "IsApproved": true
  }
]