{
  "common": {
    "lastUpdated": "Последна актуализация: {{date}}"
  },
  "terms": {
    "title": "Условия за ползване",
    "intro": "Тези Условия за ползване (\"Условия\") уреждат достъпа и използването на BookHub. Със създаването на акаунт или използването на услугата, вие приемате тези Условия.",
    "sections": {
      "who": {
        "title": "1. Кои сме ние",
        "text": "BookHub се управлява от Александър Милев (България). Контакт: {{email}}."
      },
      "age": {
        "title": "2. Допустимост и възраст",
        "text": "Услугата не е предназначена за деца под {{age}} години. Ако сте под {{age}}, не създавайте акаунт. Ако сте родител/настойник и смятате, че детето ви използва услугата, свържете се с нас за премахване на акаунта."
      },
      "accounts": {
        "title": "3. Акаунти и сигурност",
        "items": [
          "Трябва да предоставите коректна регистрационна информация.",
          "Вие носите отговорност за конфиденциалността на акаунта си и всички действия, извършени чрез него.",
          "Удостоверяването използва JWT токен, съхраняван в браузъра. Ако използвате споделено устройство, излезте от акаунта си след приключване."
        ]
      },
      "content": {
        "title": "4. Потребителско съдържание",
        "text": "Можете да създавате съдържание като профили, ревюта, съобщения, списъци за четене и други (\"Потребителско съдържание\"). Вие запазвате собствеността върху него. С публикуването му предоставяте ограничен лиценз да го хостваме, съхраняваме, възпроизвеждаме и показваме единствено с цел предоставяне и подобряване на услугата."
      },
      "acceptable": {
        "title": "5. Допустимо използване",
        "lead": "Съгласявате се да не:",
        "items": [
          "Използвате услугата за незаконни дейности.",
          "Тормозите, злоупотребявате, заплашвате или се представяте за друг човек.",
          "Качвате зловреден софтуер, опитвате да хакнете или да нарушите работата на услугата.",
          "Скрапвате/обхождате/копирате съдържание по начин, който вреди на услугата или нарушава закона.",
          "Публикувате съдържание, което нарушава права на интелектуална собственост или лична неприкосновеност."
        ]
      },
      "moderation": {
        "title": "6. Модерация и прилагане",
        "text": "Можем да премахваме съдържание, да ограничаваме функционалности или да спираме/прекратяваме акаунти с цел безопасност и спазване на правилата, включително при нарушение на тези Условия."
      },
      "deletion": {
        "title": "7. Изтриване на акаунт",
        "text": "Можете да изтриете акаунта си в приложението. В момента изтриването е реализирано като soft-delete (акаунтът се маркира като изтрит и се скрива от нормална употреба). Част от съдържанието може да остане видимо, ако е необходимо за целостта на услугата, но се стремим да премахваме или анонимизираме личните идентификатори, когато е разумно."
      },
      "disclaimers": {
        "title": "8. Отказ от гаранции",
        "text": "Услугата се предоставя \"както е\" и \"както е налична\". Не гарантираме, че услугата винаги ще бъде налична, сигурна или без грешки."
      },
      "liability": {
        "title": "9. Ограничаване на отговорността",
        "text": "До максималната степен, позволена от закона, не носим отговорност за непреки, случайни, специални, последващи или наказателни вреди, нито за загуба на данни, печалби или репутация, произтичащи от използването на услугата."
      },
      "changes": {
        "title": "10. Промени",
        "text": "Можем да актуализираме тези Условия. Ще променим датата на \"Последна актуализация\" и при съществени промени може да предоставим допълнително известие."
      }
    }
  },
  "privacy": {
    "title": "Политика за поверителност",
    "intro": "Тази политика обяснява как BookHub събира и използва лични данни при използване на услугата.",
    "sections": {
      "controller": {
        "title": "1. Администратор и контакт",
        "text": "Администратор: Александър Милев (България). Контакт: {{email}}."
      },
      "data": {
        "title": "2. Лични данни, които събираме",
        "items": [
          "Данни за акаунт: имейл, потребителско име, парола (съхранява се като сигурен хеш), потребителски идентификатор.",
          "Данни за профил: име, фамилия, профилна снимка, по желание дата на раждане, по желание линк към социална мрежа, по желание биография и настройка „личен профил“.",
          "Потребителско съдържание: ревюта, гласове, списъци за четене, добавени книги/автори, чатове и съобщения и друго съдържание, което предоставяте.",
          "Технически/сигурност: логове и събития по сигурността могат да включват IP адрес, времеви печати, информация за устройство/браузър и метаданни на заявки."
        ]
      },
      "use": {
        "title": "3. Как използваме данните",
        "items": [
          "За създаване и управление на акаунти и профили.",
          "За предоставяне на функционалности като ревюта, чатове и списъци за четене.",
          "За сигурност, предотвратяване на злоупотреби и отстраняване на проблеми.",
          "За изпращане на транзакционни имейли (напр. welcome имейл)."
        ]
      },
      "basis": {
        "title": "4. Правни основания (GDPR)",
        "items": [
          "Договор: обработване, необходимо за предоставяне на услугата (акаунт, профил, функционалности).",
          "Легитимен интерес: сигурност, предотвратяване на измами/злоупотреби и надеждна работа.",
          "Съгласие: когато е необходимо (напр. ако в бъдеще добавим не-необходими бисквитки или маркетингови имейли)."
        ]
      },
      "sharing": {
        "title": "5. Споделяне и обработващи",
        "lead": "Споделяме лични данни само доколкото е нужно за услугата:",
        "items": [
          "Хостинг: Microsoft Azure (инфраструктура).",
          "Имейл изпращане/тестове: Mailtrap.",
          "Съхранение на изображения: на сървъра на приложението (не в облак)."
        ],
        "note": "Ако в бъдеще добавим аналитика/реклама, ще актуализираме политиката и при нужда ще поискаме съгласие."
      },
      "retention": {
        "title": "6. Срокове за съхранение",
        "items": [
          "Данни за акаунт/профил: докато акаунтът е активен. При изтриване в момента е soft-delete.",
          "Срок на JWT токена: обикновено 7 дни или 30 дни при „Запомни ме“.",
          "Логове за сигурност: само толкова, колкото е нужно за сигурност и диагностика (обикновено кратък период)."
        ]
      },
      "rights": {
        "title": "7. Вашите права",
        "text": "В зависимост от местоположението ви (вкл. ЕС/ЕИП) може да имате права за достъп, корекция, изтриване, ограничаване, възражение и преносимост. За упражняване на права пишете на {{email}}."
      },
      "profiles": {
        "title": "8. Публични и лични профили",
        "text": "Ако профилът ви е личен, ограничаваме видимостта според дизайна на функционалността. Ако е публичен, част от полетата и активността ви може да са видими за други потребители."
      },
      "children": {
        "title": "9. Деца",
        "text": "Услугата не е предназначена за деца под {{age}} години. Ако установим, че дете е предоставило лични данни, ще предприемем действия за изтриването им."
      },
      "changes": {
        "title": "10. Промени",
        "text": "Можем да актуализираме тази политика. Ще обновим датата на „Последна актуализация“ и при съществени промени може да предоставим допълнително известие."
      }
    }
  },
  "cookies": {
    "title": "Политика за бисквитки",
    "intro": "Тази политика обяснява как BookHub използва бисквитки и подобни технологии.",
    "sections": {
      "what": {
        "title": "1. Какво са бисквитките?",
        "text": "Бисквитките са малки текстови файлове, които се записват на устройството ви. Подобни технологии са local storage и session storage."
      },
      "today": {
        "title": "2. Какво използваме в момента",
        "text": "В момента не използваме аналитични или рекламни бисквитки. Използваме само „строго необходими“ технологии за основна функционалност.",
        "items": [
          "Съхранение за удостоверяване: JWT токен, записан в браузъра, за да останете логнати и за оторизация към API.",
          "Сигурност/анти-злоупотреби: ограничени бисквитки или хедъри могат да се използват от инфраструктурата за защита (напр. rate limiting)."
        ]
      },
      "manage": {
        "title": "3. Управление на съхранението",
        "items": [
          "Можете да излезете от акаунта си, за да премахнете състоянието на логване.",
          "Можете да изчистите данните на сайта (cookies/local storage), за да премахнете токени и настройки."
        ]
      },
      "future": {
        "title": "4. Ако добавим аналитика/маркетинг",
        "text": "Ако добавим не-необходими бисквитки (аналитика/реклама), ще актуализираме страницата и при нужда ще поискаме съгласие преди да ги зададем."
      },
      "contact": {
        "title": "5. Контакт",
        "text": "Въпроси? Пишете на {{email}}."
      }
    }
  },
  "notice": {
    "text": "BookHub използва строго необходими технологии за съхранение (напр. токен за вход), за да работи услугата.",
    "learnMore": "Научи повече",
    "ok": "OK"
  }
}
